{
    "results": [
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633437630/",
            "title": "Building Quantum Software with Python",
            "description": "<span><b>A developer-centric look at quantum computing.</b><br/><br/>The demand for developers who can implement solutions with quantum resources is growing larger every day. <i>Building Quantum Software with Python</i> gives you the foundation you need to build the software for the quantum age, and apply quantum computing to real-world business and research problems.<br/><br/>In <i>Building Quantum Software with Python</i> you will learn about:<br/><br/><ul><li>Quantum states, gates, and circuits</li><li>A practical introduction to quantum algorithms</li><li>Running quantum software on classical simulators and quantum hardware</li><li>Quantum search, phase estimation, and quantum counting</li><li>Quantum solutions to optimization problems</li></ul><br/><i>Building Quantum Software with Python</i> lays out the math and programming techniques you’ll need to apply quantum solutions to real challenges like sampling from classically intractable probability distributions and large-scale optimization problems. You will learn which quantum algorithms and patterns apply to different types of problems and how to build your first quantum applications. All the simulator code you write can be easily converted to run on real quantum hardware.<br/><br/><b>About the Technology</b><br/>Large-scale optimization problems, complex financial and scientific simulations, cryptographic calculations, and certain types of machine learning require unreasonably long times to run on classical computers. Quantum computers can perform some operations like these almost instantaneously! Don’t wait to get started. This book will prime you on quantum applications, implementations, and hybrid quantum-classic designs so you’ll be ready to join the quantum revolution.<br/><br/><b>About the Book</b><br/><i>Building Quantum Software with Python</i> teaches you how to build working applications that run on a simulator or real quantum hardware. By relating QC to classical computing concepts you already know, this book’s intuitive visualizations and code implementations make quantum computing easy to grasp even if you don’t have a background in advanced math. As you go, you’ll discover and implement quantum techniques for truly random sampling, optimization solutions, unstructured search, and more—all using easy-to-follow Python code.<br/><br/><b>What's Inside</b><br/><ul><li>Hype-free discussions of when, where, and why QC makes sense</li><li>Solving complex optimization problems</li><li>Quantum search using Grover’s Algorithm</li><li>Fourier transform, phase estimation, and probability distribution sampling</li></ul><br/><br/><b>About the Reader</b><br/>For developers who know Python. No advanced math knowledge required.<br/><br/><b>About the Authors</b><br/><b>Constantin Gonciulea</b> leads the Advanced Technology group at Wells Fargo and has worked in quantum computing since 2018. <b>Charlee Stefanski</b> is a senior software engineer at Wells Fargo, where she leads the development of the internal quantum computing platform.<br/><br/><b>Quotes</b><br/><i>This book truly shines! I highly recommend it!</i><br/>- Alex Khan, Author of Quantum Computing Experimentation with Amazon Braket<br/><br/><i>A clear and accessible introduction, bridging the gap between theory and practice with a hands-on approach.</i><br/>- Iordanis Kerenidis, Quantum Signals<br/><br/><i>Uses only basic mathematics without sacrificing rigor and accuracy. An invaluable resource!</i><br/>- Marian Gidea, Yeshiva University<br/><br/><i>The very best introduction to quantum computing. A joy to read!</i><br/>- Robert Hundt, Author of Quantum Computing for Programmers<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633439672/",
            "title": "Build a Robo-Advisor with Python (From Scratch)",
            "description": "<span><b>Take control of your wealth management by building your own reliable, effective, and automated financial advisor tool.</b><br/><br/>Automated digital financial advisors—also called robo-advisors—manage billions of dollars in assets. Follow the step-by-step instructions in this hands-on guide, and you’ll learn to build your robo-advisor capable of managing a real investing strategy.<br/><br/>In <i>Build a Robo-Advisor with Python (From Scratch)</i> you’ll learn how to:<br/><br/><ul><li>Measure returns and estimate the benefits of robo-advisors</li><li>Use Monte Carlo simulations to build and test financial planning tools</li><li>Construct diversified, efficient portfolios using optimization and other methods</li><li>Implement and evaluate rebalancing methods to track a target portfolio over time</li><li>Decrease taxes through tax-loss harvesting and optimized withdrawal sequencing</li><li>Use reinforcement learning to find the optimal investment path up to, and after, retirement</li></ul><br/>Automated “robo-advisors” are commonplace in financial services, thanks to their ability to give high-quality investment advice at a fraction of the cost of human advisors. <i>Build a Robo-Advisor with Python (From Scratch)</i> teaches you to develop one of these powerful, flexible tools using popular and free Python libraries. You’ll master practical Python skills in demand in financial services, and financial planning skills that will help you take the best care of your money. All examples are accompanied by working Python code, and are easy to adjust for investors anywhere in the world.<br/><br/><b>About the Technology</b><br/>Millions of investors use robo-advisors as an alternative to human financial advisors. In this one-of-a-kind guide, you’ll learn how to build one of your own. Your robo-advisor will assist you with all aspects of financial planning, including saving for retirement, creating a diversified portfolio, and decreasing your tax bill. And along the way, you’ll learn a lot about Python and finance!<br/><br/><b>About the Book</b><br/><i>Build a Robo-Advisor with Python (From Scratch)</i> guides you step-by-step, feature-by-feature as you create a robo-advisor from the ground up. As you go, you’ll dive into techniques like reinforcement learning, convex optimization, and Monte Carlo methods that you can apply even outside the field of FinTech. When you finish, your powerful assistant will be able to create optimal asset allocations, rebalance investments while minimizing taxes, and more.<br/><br/><b>What's Inside</b><br/><ul><li>Advanced portfolio construction techniques</li><li>Tax-loss harvesting, sequencing of retirement withdrawals, and asset location</li><li>Financial planning using AI and Monte Carlo simulations</li><li>Rebalancing methods to track a portfolio over time</li></ul><br/><br/><b>About the Reader</b><br/>Accessible to anyone with a basic knowledge of Python and finance—no special skills required.<br/><br/><b>About the Authors</b><br/><b>Rob Reider</b> is a quantitative hedge fund portfolio manager. He holds a PhD in Finance from The Wharton School and is an Adjunct Professor at NYU. <b>Alex Michalka</b> is head of investments research at Wealthfront. He holds a PhD from Columbia University.<br/><br/><b>Quotes</b><br/><i>Takes a light and engaging approach, while encouraging hands-on experimentation. I plan to borrow techniques and methods from it and highly recommend it.</i><br/>- Daniel Bienstock, Columbia University<br/><br/><i>A comprehensive tour of modern asset allocation techniques, suitable for investors of all sizes. Makes sophisticated strategies accessible to all.</i><br/>- Jonathan Larkin, Columbia Investment Management Co., LLC<br/><br/><i>An indispensable guide to the intricacies of automated investment management. Practical, hands-on, authoritative, and comprehensive.</i><br/>- Petter N. Kolm, New York University, Quant of the Year 2021<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633436336/",
            "title": "The Quick Python Book, Fourth Edition",
            "description": "<span><b>A fast-paced introduction to Python for intermediate developers–now with coverage of generative AI!</b><br/><br/>For over 25 years, <i>The Quick Python Book</i> has been one of the best Python books money can buy. It concisely covers programming basics, while introducing Python's comprehensive standard library and unique features in depth and detail. In this fourth edition, you’ll find new coverage of AI coding tools like Copilot and Google's Colaboratory (Colab), and develop a mindset that can make the most of AI.<br/><br/><i>The Quick Python Book, Fourth Edition</i> includes:<br/><br/><ul><li>Python syntax, data structures, and best practices</li><li>Python as an object oriented language</li><li>Common Python libraries</li><li>Basic data handling with Python</li><li>Using AI code generation tools with Python</li></ul><br/>Whether you’re new to Python or looking to advance your basic skills, <i>The Quick Python Book, Fourth Edition</i> will get you writing effective Python code fast. Python authority and former Chair of the Python Software Foundation Board or Directors <b>Naomi Ceder</b> has returned to author this extensively revised fourth edition. With the personal touch of a skilled teacher, Naomi beautifully balances details of the language with the insights and advice you need to handle any task.<br/><br/><b>About the Technology</b><br/>System automation. High-performance web apps. Cloud and back-end services. Cutting edge AI. No matter what you’re building, it pays to know how to read and write Python! <i>The Quick Python Book</i> has helped over 100,000 developers get up to speed with the Python programming language. This revised Fourth Edition, fully updated for Python 3.13, explores the latest features and libraries and shows you how to code smarter with AI tools like ChatGPT.<br/><br/><b>About the Book</b><br/><i>The Quick Python Book, Fourth Edition</i> teaches you the essential Python features and techniques you need for most common scripting, application programming, and data science tasks. Written for developers comfortable with another programming language, it dives right into the good stuff. New interactive notebooks, quick-check questions, and end-of-chapter labs all help practice and consolidate your new skills. Plus, you’ll find practical advice on writing prompts and using AI assistants to accelerate your day-to-day work.<br/><br/><b>What's Inside</b><br/><ul><li>Python syntax, data structures, and best practices</li><li>Object-oriented Python</li><li>Must-know Python libraries</li><li>Data handling</li></ul><br/><br/><b>About the Reader</b><br/>For beginning-intermediate programmers. No prior experience with Python required.<br/><br/><b>About the Author</b><br/><b>Naomi Ceder</b> has been learning, teaching, and writing about Python since 2001. An elected fellow of the Python Software Foundation, Naomi is a past chair of its board of directors. In 2022 she became the seventh person to receive the PSF Distinguished Service Award.<br/><br/><b>Quotes</b><br/><i>Brilliantly crafted! It’s the book I recommend to smart people learning Python for the first time.</i><br/>- David Q Mertz, Service Employees International Union<br/><br/><i>A good Python book should be on everybody’s bookshelf. Let me suggest The Quick Python Book!</i><br/>- Delio D’Anna, cognitivplus<br/><br/><i>I recommend it! It’s useful, clear, and engaging—a combination that’s difficult to achieve!</i><br/>- Doug Farrell, Author of The Well-Grounded Python Developer<br/><br/><i>Hits the sweet spot between quick overview and deep dive.</i><br/>- Trey Hunner, Python Morsels<br/><br/></span>",
            "topic": "Python"
        },      
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617296864/",
            "title": "Deep Learning with Python, Second Edition",
            "description": "<span><b>Printed in full color! Unlock the groundbreaking advances of deep learning with this extensively revised new edition of the bestselling original. Learn directly from the creator of Keras and master practical Python deep learning techniques that are easy to apply in the real world.</b><br/><br/>In <i>Deep Learning with Python, Second Edition</i> you will learn:<br/><br/><ul><li>Deep learning from first principles</li><li>Image classification and image segmentation</li><li>Timeseries forecasting</li><li>Text classification and machine translation</li><li>Text generation, neural style transfer, and image generation</li><li>Printed in full color throughout</li></ul><br/><i>Deep Learning with Python</i> has taught thousands of readers how to put the full capabilities of deep learning into action. This extensively revised full color second edition introduces deep learning using Python and Keras, and is loaded with insights for both novice and experienced ML practitioners. You’ll learn practical techniques that are easy to apply in the real world, and important theory for perfecting neural networks.<br/><br/><b>About the Technology</b><br/>Recent innovations in deep learning unlock exciting new software capabilities like automated language translation,  image recognition, and more. Deep learning is quickly becoming essential knowledge for every software developer, and modern tools like Keras and TensorFlow put it within your reach—even if you have no background in mathematics or data science. This book shows you how to get started.<br/><br/><b>About the Book</b><br/><i>Deep Learning with Python, Second Edition</i> introduces the field of deep learning using Python and the powerful Keras library. In this revised and expanded new edition, Keras creator François Chollet offers insights for both novice and experienced machine learning practitioners. As you move through this book, you’ll build your understanding through intuitive explanations, crisp color illustrations, and clear examples. You’ll quickly pick up the skills you need to start developing deep-learning applications.<br/><br/><b>What's Inside</b><br/><ul><li>Deep learning from first principles</li><li>Image classification and image segmentation</li><li>Time series forecasting</li><li>Text classification and machine translation</li><li>Text generation, neural style transfer, and image generation</li><li>Printed in full color throughout</li></ul><br/><br/><b>About the Reader</b><br/>For readers with intermediate Python skills. No previous experience with Keras, TensorFlow, or machine learning is required.<br/><br/><b>About the Author</b><br/><b>François Chollet</b> is a software engineer at Google and creator of the Keras deep-learning library.<br/><br/><b>Quotes</b><br/><i>Chollet is a master of pedagogy and explains complex concepts with minimal fuss, cutting through the math with practical Python code. He is also an experienced ML researcher and his insights on various model architectures or training tips are a joy to read.</i><br/>- Martin Görner, Google<br/><br/><i>Immerse yourself into this exciting introduction to the topic with lots of real-world examples. A must-read for every deep learning practitioner.</i><br/>- Sayak Paul, Carted<br/><br/><i>The modern classic just got better.</i><br/>- Edmon Begoli, Oak Ridge National Laboratory<br/><br/><i>Truly the bible of deep learning.</i><br/>- Yiannis Paraskevopoulos, University of West Attica<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633437784/",
            "title": "Learn AI-Assisted Python Programming",
            "description": "<span><b>Writing computer programs in Python just got a lot easier! Use AI-assisted coding tools like GitHub Copilot and ChatGPT to turn your ideas into applications faster than ever.</b><br/><br/>AI has changed the way we write computer programs. With tools like Copilot and ChatGPT, you can describe what you want in plain English, and watch your AI assistant generate the code right before your eyes. It’s perfect for beginners, or anyone who’s struggled with the steep learning curve of traditional programming.<br/><br/>In <i>Learn AI-Assisted Python Programming: With GitHub Copilot and ChatGPT</i> you’ll learn how to:<br/><br/><ul><li>Write fun and useful Python applications—no programming experience required!</li><li>Use the Copilot AI coding assistant to create Python programs</li><li>Write prompts that tell Copilot exactly what to do</li><li>Read Python code and understand what it does</li><li>Test your programs to make sure they work the way you want them to</li><li>Fix code with prompt engineering or human tweaks</li><li>Apply Python creatively to help out on the job</li></ul><br/><i>Learn AI-Assisted Python Programming: With GitHub Copilot and ChatGPT</i> is a hands-on beginner’s guide that is written by two esteemed computer science university professors. It teaches you everything you need to start programming Python in an AI-first world. You’ll hit the ground running, writing prompts that tell your AI-assistant exactly what you want your programs to do. Along the way, you’ll pick up the essentials of Python programming and practice the higher-level thinking you’ll need to create working apps for data analysis, automating tedious tasks, and even video games.<br/><br/><b>About the Technology</b><br/>The way people write computer programs has changed forever. Using GitHub Copilot, you describe in plain English what you want your program to do, and the AI generates it instantly.<br/><br/><b>About the Book</b><br/>This book shows you how to create and improve Python programs using AI—even if you’ve never written a line of computer code before. Spend less time on the slow, low-level programming details and instead learn how an AI assistant can bring your ideas to life immediately. As you go, you’ll even learn enough of the Python language to understand and improve what your AI assistant creates.<br/><br/><b>What's Inside</b><br/><ul><li>Prompts for working code</li><li>Tweak code manually and with AI help</li><li>AI-test your programs</li><li>Let AI handle tedious details</li></ul><br/><br/><b>About the Reader</b><br/>If you can move files around on your computer and install new programs, you can learn to write useful software!<br/><br/><b>About the Authors</b><br/>Dr. <b>Leo Porter</b> is a Teaching Professor at UC San Diego. Dr. <b>Daniel Zingaro</b> is an Associate Teaching Professor at the University of Toronto. The technical editor on this book was Peter Morgan.<br/><br/><b>Quotes</b><br/><i>...masterfully blends the basics of programming with the effective use of AI tools to produce code.</i><br/>- Mehran Sahami, Stanford University<br/><br/><i>This is such a well thought out book from the point of view of someone just starting to code post generative AI tools.</i><br/>- Ana Bell, MIT<br/><br/><i>You are about to learn programming with one of the most exciting human task - supporters of this century...</i><br/>- From the foreword by Beth Simon, UC San Diego<br/><br/><i>This book accelerates your Copilot programming learning journey beyond what I ever thought possible.</i><br/>- Austin Z. Henley, Microsoft<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299889/",
            "title": "Time Series Forecasting in Python",
            "description": "<span><b>Build predictive models from time-based patterns in your data. Master statistical models including new deep learning approaches for time series forecasting.</b><br/><br/>In <i>Time Series Forecasting in Python</i> you will learn how to:<br/><br/><ul><li>Recognize a time series forecasting problem and build a performant predictive model</li><li>Create univariate forecasting models that account for seasonal effects and external variables</li><li>Build multivariate forecasting models to predict many time series at once</li><li>Leverage large datasets by using deep learning for forecasting time series</li><li>Automate the forecasting process</li></ul><br/><i>Time Series Forecasting in Python</i> teaches you to build powerful predictive models from time-based data. Every model you create is relevant, useful, and easy to implement with Python. You’ll explore interesting real-world datasets like Google’s daily stock price and economic data for the USA, quickly progressing from the basics to developing large-scale models that use deep learning tools like TensorFlow.<br/><br/><b>About the Technology</b><br/>You can predict the future—with a little help from Python, deep learning, and time series data! Time series forecasting is a technique for modeling time-centric data to identify upcoming events. New Python libraries and powerful deep learning tools make accurate time series forecasts easier than ever before.<br/><br/><b>About the Book</b><br/><i>Time Series Forecasting in Python</i> teaches you how to get immediate, meaningful predictions from time-based data such as logs, customer analytics, and other event streams. In this accessible book, you’ll learn statistical and deep learning methods for time series forecasting, fully demonstrated with annotated Python code. Develop your skills with projects like predicting the future volume of drug prescriptions, and you’ll soon be ready to build your own accurate, insightful forecasts.<br/><br/><b>What's Inside</b><br/><ul><li>Create models for seasonal effects and external variables</li><li>Multivariate forecasting models to predict multiple time series</li><li>Deep learning for large datasets</li><li>Automate the forecasting process</li></ul><br/><br/><b>About the Reader</b><br/>For data scientists familiar with Python and TensorFlow.<br/><br/><b>About the Author</b><br/><b>Marco Peixeiro</b> is a seasoned data science instructor who has worked as a data scientist for one of Canada’s largest banks.<br/><br/><b>Quotes</b><br/><i>The importance of time series analysis cannot be overstated. This book provides key techniques to deal with time series data in real-world applications. Indispensable.</i><br/>- Amaresh Rajasekharan, IBM<br/><br/><i>Marco Peixeiro presents concepts clearly using interesting examples and illustrative plots. You’ll be up and running quickly using the power of Python.</i><br/>- Ariel Andres, MD Financial Management<br/><br/><i>What caught my attention were the practical examples immediately applicable to real life. He explains complex topics without the excess of mathematical formalism.</i><br/>- Simone Sguazza, University of Applied Sciences and Arts of Southern Switzerland<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617298660/",
            "title": "Python Concurrency with asyncio",
            "description": "<span><b>Learn how to speed up slow Python code with concurrent programming and the cutting-edge asyncio library.</b><br/><br/><ul><li>Use coroutines and tasks alongside async/await syntax to run code concurrently</li><li>Build web APIs and make concurrency web requests with aiohttp</li><li>Run thousands of SQL queries concurrently</li><li>Create a map-reduce job that can process gigabytes of data concurrently</li><li>Use threading with asyncio to mix blocking code with asyncio code</li></ul><br/>Python is flexible, versatile, and easy to learn. It can also be very slow compared to lower-level languages. <i>Python Concurrency with asyncio</i> teaches you how to boost Python's performance by applying a variety of concurrency techniques. You'll learn how the complex-but-powerful asyncio library can achieve concurrency with just a single thread and use asyncio's APIs to run multiple web requests and database queries simultaneously. The book covers using asyncio with the entire Python concurrency landscape, including multiprocessing and multithreading.<br/><br/><b>About the Technology</b><br/>It’s easy to overload standard Python and watch your programs slow to a crawl. Th e asyncio library was built to solve these problems by making it easy to divide and schedule tasks. It seamlessly handles multiple operations concurrently, leading to apps that are lightning fast and scalable.<br/><br/><b>About the Book</b><br/><i>Python Concurrency with asyncio</i> introduces asynchronous, parallel, and concurrent programming through hands-on Python examples. Hard-to-grok concurrency topics are broken down into simple flowcharts that make it easy to see how your tasks are running. You’ll learn how to overcome the limitations of Python using asyncio to speed up slow web servers and microservices. You’ll even combine asyncio with traditional multiprocessing techniques for huge improvements to performance.<br/><br/><b>What's Inside</b><br/><ul><li>Build web APIs and make concurrency web requests with aiohttp</li><li>Run thousands of SQL queries concurrently</li><li>Create a map-reduce job that can process gigabytes of data concurrently</li><li>Use threading with asyncio to mix blocking code with asyncio code</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Python programmers. No previous experience of concurrency required.<br/><br/><b>About the Author</b><br/><b>Matthew Fowler</b> has over 15 years of software engineering experience in roles from architect to engineering director.<br/><br/><b>Quotes</b><br/><i>A clear and practical guide to using asyncio to solve real-world concurrency problems.</i><br/>- Didier Garcia, Software Sushi<br/><br/><i>Well organized and written…effectively guides the reader through a variety of impactful concurrency techniques.</i><br/>- Dan Sheikh, BCG Digital Ventures<br/><br/><i>If you want to efficiently take your Python skills to the next level, look no further. This is the book for you.</i><br/>- Eli Mayost, IBM<br/><br/><i>Provides a lot of insights into one of the trickier aspects of Python programming, namely asyncio.</i><br/>- Peter White, Charles Sturt University<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297441/",
            "title": "The Well-Grounded Python Developer",
            "description": "<span><b>If you’re new to Python, it can be tough to understand when, where, and how to use all its language features. This friendly guide shows you how the Python ecosystem fits together, and grounds you in the skills you need to continue your journey to being a software developer.</b><br/><br/>Inside <i>The Well-Grounded Python Developer</i> you will discover:<br/><br/><ul><li>Building modules of functionality</li><li>Creating a well-constructed web server application</li><li>Integrating database access into your Python applications</li><li>Refactor and decoupling systems to help scale them</li><li>How to think about the big picture of your application</li></ul><br/><i>The Well-Grounded Python Developer</i> builds on Python skills you’ve learned in isolation and shows you how to unify them into a meaningful whole. It helps you understand the dizzying array of libraries and teaches important concepts, like modular construction, APIs, and the design of a basic web server. As you work through this practical guide, you’ll discover how all the bits of Python link up as you build and modify a typical web server application—the kind of web app that’s in high demand by modern businesses.<br/><br/><b>About the Technology</b><br/>As a new programmer, you’re happy just to see your code run. A professional developer, on the other hand, needs to create software that runs reliably. It must be fast, maintainable, scalable, secure, well designed and documented, easy for others to update, and quick to ship. This book teaches you the skills you need to go from Python programmer to Python developer.<br/><br/><b>About the Book</b><br/><i>The Well-Grounded Python Developer</i> shows you why Python, the world’s most popular programming language, is a fantastic tool for professional development. It guides you through the most important skills, like how to name variables, functions, and classes, how to identify and write a good API, and how to use objects. You’ll also learn how to deal with inevitable failures, how to make software that connects to the internet, core security practices, and many other professional-grade techniques.<br/><br/><b>What's Inside</b><br/><ul><li>Create a web application</li><li>Connect to a database</li><li>Design programs to handle big tasks</li></ul><br/><br/><b>About the Reader</b><br/>For experienced beginners who want to learn professional-level skills.<br/><br/><b>About the Author</b><br/><b>Doug Farrell</b> has been a professional developer since 1983, and has worked with Python for over 20 years.<br/><br/><b>Quotes</b><br/><i>A fun journey, and a great resource. With this book as your guide, you’ll be on the summit before you know it.</i><br/>- From the Foreword by Michael Kennedy, founder of Talk Python Training<br/><br/><i>Well-structured with excellent code examples. I highly recommend getting this book to build your Python skills.</i><br/>- Stanley Anozie, Hospitality Digital<br/><br/><i>An excellent tutorial in the foundations of Python development for both the novice and experienced developer.</i><br/>- Philip Best, Amazon<br/><br/><i>This is the best Python reference I’ve read so far.</i><br/>- Julien Pohie, ThoughtWorks<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297939/",
            "title": "Fast Python",
            "description": "<span><b>Master Python techniques and libraries to reduce run times, efficiently handle huge datasets, and optimize execution for complex machine learning applications.</b><br/><br/><i>Fast Python</i> is a toolbox of techniques for high performance Python including:<br/><br/><ul><li>Writing efficient pure-Python code</li><li>Optimizing the NumPy and pandas libraries</li><li>Rewriting critical code in Cython</li><li>Designing persistent data structures</li><li>Tailoring code for different architectures</li><li>Implementing Python GPU computing</li></ul><br/><i>Fast Python</i> is your guide to optimizing every part of your Python-based data analysis process, from the pure Python code you write to managing the resources of modern hardware and GPUs. You'll learn to rewrite inefficient data structures, improve underperforming code with multithreading, and simplify your datasets without sacrificing accuracy.<br/><br/>Written for experienced practitioners, this book dives right into practical solutions for improving computation and storage efficiency. You'll experiment with fun and interesting examples such as rewriting games in Cython and implementing a MapReduce framework from scratch. Finally, you'll go deep into Python GPU computing and learn how modern hardware has rehabilitated some former antipatterns and made counterintuitive ideas the most efficient way of working.<br/><br/><b>About the Technology</b><br/>Face it. Slow code will kill a big data project. Fast pure-Python code, optimized libraries, and fully utilized multiprocessor hardware are the price of entry for machine learning and large-scale data analysis. What you need are reliable solutions that respond faster to computing requirements while using less resources, and saving money.<br/><br/><b>About the Book</b><br/><i>Fast Python</i> is a toolbox of techniques for speeding up Python, with an emphasis on big data applications. Following the clear examples and precisely articulated details, you’ll learn how to use common libraries like NumPy and pandas in more performant ways and transform data for efficient storage and I/O. More importantly, Fast Python takes a holistic approach to performance, so you’ll see how to optimize the whole system, from code to architecture.<br/><br/><b>What's Inside</b><br/><ul><li>Rewriting critical code in Cython</li><li>Designing persistent data structures</li><li>Tailoring code for different architectures</li><li>Implementing Python GPU computing</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Python programmers familiar with the basics of concurrency.<br/><br/><b>About the Author</b><br/><b>Tiago Antao</b> is one of the co-authors of Biopython, a major bioinformatics package written in Python.<br/><br/><b>Quotes</b><br/><i>A great resource for learning how to create performant Python code.</i><br/>- Or Golan, Qedma Quantum Computing<br/><br/><i>If you think Python is too slow, this book is for you! Parallelization. Vectorization. Using Cython and Numba to compile to C. Putting code onto a GPU to massively parallelize it. Buy a copy for every data scientist in your org.</i><br/>- James Liu, Mediaocean<br/><br/><i>The time you invest reading this book will be repaid multifold in your project’s design and the performance you’ll gain.</i><br/>- Ruud Gijsen, Simbeyond<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299919/",
            "title": "Publishing Python Packages",
            "description": "<span><b>Create masterful, maintainable Python packages! This book includes pro tips for design, automation, testing, deployment, and even release as an open source project!</b><br/><br/>In <i>Publishing Python Packages</i> you will learn how to:<br/><br/><ul><li>Build extensions and console script commands</li><li>Use tox to automate packaging, installing, and testing</li><li>Build a continuous integration pipeline using GitHub Actions</li><li>Improve code quality and reduce manual review using black, mypy, and flake8</li><li>Create published documentation for your packages</li><li>Keep packages up to date with pyupgrade and Dependabot</li><li>Foster an open source community using GitHub features</li></ul><br/><i>Publishing Python Packages</i> teaches you how to easily share your Python code with your team and the outside world. Learn a repeatable and highly automated process for package maintenance that’s based on the best practices, tools, and standards of Python packaging. This book walks you through creating a complete package, including a C extension, and guides you all the way to publishing on the Python Package Index. Whether you’re entirely new to Python packaging or looking for optimal ways to maintain and scale your packages, this fast-paced and engaging guide is for you.<br/><br/><b>About the Technology</b><br/>Successful Python packages install easily, run flawlessly, and stay reliably up to date. Publishing perfect Python packages requires a rigorous process that supports systematic testing and review, along with excellent documentation. Fortunately, the Python ecosystem includes tools and techniques to automate package creation and publishing.<br/><br/><b>About the Book</b><br/><i>Publishing Python Packages</i> presents a practical process for sharing Python code in an automated and scalable way. Get hands-on experience with the latest packaging tools, and learn the ins and outs of package testing and continuous integration. You’ll even get pro tips for setting up a maintainable open source project, including licensing, documentation, and nurturing a community of contributors.<br/><br/><b>What's Inside</b><br/><ul><li>Build extensions and console script commands</li><li>Improve code quality with automated review and testing</li><li>Create excellent documentation</li><li>Keep packages up to date with pyupgrade and Dependabot</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Python programmers.<br/><br/><b>About the Author</b><br/><b>Dane Hillard</b> has spent the majority of his development career using Python to build web applications.<br/><br/><b>Quotes</b><br/><i>...practical...I learned a lot from this book. A wholly modern approach to current packaging tooling and the problems faced by package developers…I think you’ll find it to be a useful source and an inspiration.</i><br/>- From the Foreword by David Beazley, author of Python Distilled<br/><br/><i>A comprehensive guide to the Python packaging landscape. Dane takes a complicated topic and makes you think, ‘Yeah, I got this.’ It’s impressively done. Recommended.</i><br/>- Carlton Gibson, Django Project<br/><br/><i>A comprehensive guide for Python programmers ready to share their code with the world.</i><br/>- Joshua A. McAdams, Senior Software Engineer, Google<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617295508/",
            "title": "Python Workout",
            "description": "<span>    The only way to master a skill is to practice. In <i>Python Workout</i>, author <b>Reuven M. Lerner</b> guides you through 50 carefully selected exercises that invite you to flex your programming muscles. As you take on each new challenge, you'll build programming skill and confidence. The thorough explanations help you lock in what you've learned and apply it to your own projects. Along the way, Python Workout provides over four hours of video instruction walking you through the solutions to each exercise and dozens of additional exercises for you to try on your own.<br/><br/><b>About the Technology</b><br/>To become a champion Python programmer you need to work out, building mental muscle with your hands on the keyboard. Each carefully selected exercise in this unique book adds to your Python prowess—one important skill at a time.<br/><br/><b>About the Book</b><br/><i>Python Workout</i> presents 50 exercises that focus on key Python 3 features. In it, expert Python coach <b>Reuven Lerner</b> guides you through a series of small projects, practicing the skills you need to tackle everyday tasks. You'll appreciate the clear explanations of each technique, and you can watch Reuven solve each exercise in the accompanying videos.<br/><br/><b>What's Inside</b><br/><ul><li>50 hands-on exercises and solutions</li><li>Coverage of all Python data types</li><li>Dozens more bonus exercises for extra practice </li></ul><br/><br/><b>About the Reader</b><br/>For readers with basic Python knowledge.<br/><br/><b>About the Author</b><br/><b>Reuven M. Lerner</b> teaches Python and data science to companies around the world.<br/><br/><b>Quotes</b><br/><i>Whether you’re a Python novice or, like me, have been away from the language for a while, this book is a great way to build strength with Python.</i><br/>- Mark Elston, Advantest America<br/><br/><i>A practical introduction to the Python programming language, built around fun and well-chosen exercises.</i><br/>- Jens Christian Bredahl Madsen, Systematic<br/><br/><i>The practical course you need to become fluent in Pythonic programming!</i><br/>- Jean-François Morin, Laval University<br/><br/><i>This book pulls back the layers and allows you to master Python.</i><br/>- Jeff Smith, Agilify Automation<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297519/",
            "title": "Tiny Python Projects",
            "description": "<span>    A long journey is really a lot of little steps. The same is true when you're learning Python, so you may as well have some fun along the way! Written in a lighthearted style with entertaining exercises that build powerful skills,<i> Tiny Python Projects </i>takes you from amateur to Pythonista as you create 22 bitesize programs. Each tiny project teaches you a new programming concept, from the basics of lists and strings right through to regular expressions and randomness. Along the way you'll also discover how testing can make you a better programmer in any language.<br/><br/><b>About the Technology</b><br/>Who says learning to program has to be boring? The 21 activities in this book teach Python fundamentals through puzzles and games. Not only will you be entertained with every exercise, but you'll learn about text manipulation, basic algorithms, and lists and dictionaries as you go. It's the ideal way for any Python newbie to gain confidence and experience.<br/><br/><b>About the Book</b><br/>The projects are tiny, but the rewards are big: each chapter in <i>Tiny Python Projects</i> challenges you with a new Python program, including a password creator, a word rhymer, and a Shakespearean insult generator. As you complete these entertaining exercises, you'll graduate from a Python beginner to a confident programmer—and you'll have a good time doing it!<br/><br/><b>What's Inside</b><br/><ul><li>Write command-line Python programs</li><li>Manipulate Python data structures</li><li>Use and control randomness</li><li>Write and run tests for programs and functions</li><li>Download testing suites for each project</li></ul><br/><br/><b>About the Reader</b><br/>For readers with beginner programming skills.<br/><br/><b>About the Author</b><br/><b>Ken Youens-Clark</b> is a Senior Scientific Programmer at the University of Arizona. He has an MS in Biosystems Engineering and has been programming for over 20 years.<br/><br/><b>Quotes</b><br/><i>Tiny Python Projects is a gentle, amusing introduction to Python that will firm up several key concepts while occasionally making you snicker.</i><br/>- Amanda Debler, Schaeffler Technologies<br/><br/><i>Knowledge meets humor meets succinctness. A gem.</i><br/>- Mafinar Khan, theScore<br/><br/><i>Learning based on doing small projects is effective, and that’s why this book is perfect.</i><br/>- Marcin Sęk, e-Xim IT<br/><br/><i>Excellent pick for those who want to improve coding skills with Python.</i><br/>- José Apablaza, Steadfast<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617298820/",
            "title": "Full Stack Python Security",
            "description": "<span><b>No-nonsense techniques, libraries, and best practices you can use to keep your Python applications safe and secure.</b><br/><br/>In <i>Full Stack Python Security: Cryptography, TLS, and attack resistance</i>, you’ll learn how to:<br/><br/><ul><li>Use algorithms to encrypt, hash, and digitally sign data</li><li>Create and install TLS certificates</li><li>Implement authentication, authorization, OAuth 2.0, and form validation in Django</li><li>Protect a web application with Content Security Policy</li><li>Implement Cross Origin Resource Sharing</li><li>Protect against common attacks including clickjacking, denial of service attacks, SQL injection, cross-site scripting, and more</li></ul><br/><i>Full Stack Python Security: Cryptography, TLS, and attack resistance</i> teaches you everything you’ll need to build secure Python web applications. As you work through the insightful code snippets and engaging examples, you’ll put security standards, best practices, and more into action. Along the way, you’ll get exposure to important libraries and tools in the Python ecosystem.<br/><br/><b>About the Technology</b><br/>Security is a full-stack concern, encompassing user interfaces, APIs, web servers, network infrastructure, and everything in between. Master the powerful libraries, frameworks, and tools in the Python ecosystem and you can protect your systems top to bottom. Packed with realistic examples, lucid illustrations, and working code, this book shows you exactly how to secure Python-based web applications.<br/><br/><b>About the Book</b><br/><i>Full Stack Python Security: Cryptography, TLS, and attack resistance</i> teaches you everything you need to secure Python and Django-based web apps. In it, seasoned security pro Dennis Byrne demystifies complex security terms and algorithms. Starting with a clear review of cryptographic foundations, you’ll learn how to implement layers of defense, secure user authentication and third-party access, and protect your applications against common hacks.<br/><br/><b>What's Inside</b><br/><ul><li>Encrypt, hash, and digitally sign data</li><li>Create and install TLS certificates</li><li>Implement authentication, authorization, OAuth 2.0, and form validation in Django</li><li>Protect against attacks such as clickjacking, cross-site scripting, and SQL injection</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Python programmers.<br/><br/><b>About the Author</b><br/><b>Dennis Byrne</b> is a tech lead for 23andMe, where he protects the genetic data of more than 10 million customers.<br/><br/><b>Quotes</b><br/><i>Truly must-have knowledge for any full stack developer!</i><br/>- Håvard Wall, Forwall AS<br/><br/><i>With great explanations of security concepts, this is a clear and well-written guide on how to apply them.</i><br/>- Tim van Deurzen, Eolas Engineering<br/><br/><i>Teaches you how to secure your apps and packages using easy-to-understand examples. An excellent read!</i><br/>- Marc-Anthony Taylor, Blackshark.ai<br/><br/><i>Even experienced developers will learn something.</i><br/>- William Jamir Silva, ESSS<br/><br/></span>",
            "topic": "Python"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617295867/",
            "title": "The Joy of JavaScript",
            "description": "<span>    Whether building interactive browser-based applications or creating server-side applications in Node, JavaScript is the most widely used language for web programming. With new features, language improvements, paradigms, and potential use cases appearing regularly, there’s never been a more exciting time to be a JavaScript developer. In<i> The Joy of JavaScript</i>, author and JavaScript expert Luis Atencio teaches you key design concepts that lead to clean, lean, modular, and easy-to-maintain code.<br/><br/><b>About the Technology</b><br/>JavaScript is at the heart of web applications on the browser side and, via the popular Node.js runtime, it often powers the server side too. Simply put, the web runs on JavaScript.<br/><br/><b>About the Book</b><br/><i>The Joy of JavaScript</i> introduces techniques that turn JavaScript programmers into JavaScript pros. You’ll work with cutting edge APIs, language features, and coding styles to tackle tricky problems in an elegant manner. Along the way, you’ll practice good object design, drive business logic with functional thinking, and untangle complex data flows.<br/><br/><b>What's Inside</b><br/><ul><li>JavaScript’s objects and module system</li><li>Working with higher order functions</li><li>Identifying and creating composable software</li><li>Preparing for upcoming JavaScript features</li></ul><br/><br/><b>About the Reader</b><br/>Written for experienced and passionate JavaScript developers.<br/><br/><b>About the Author</b><br/><b>Luis Atencio</b> is a software engineer for Citrix Systems, author of Manning’s <i>Functional Programming in JavaScript</i>, and co-author of Manning’s <i>RxJS in Action</i>.<br/><br/><b>Quotes</b><br/><i>Goes beyond purely functional programming concepts and covers every topic a developer needs to know while reading or writing JavaScript.</i><br/>- Gleb Bahmutov, Cypress.io<br/><br/><i>The actual joy here was reading it! The definitive guide to becoming a JavaScript professional.</i><br/>- Ubaldo Pescatore, Generali Business Solutions<br/><br/><i>Teaches modern JavaScript features and techniques with concise descriptions and code samples that feel like they came from a real application.</i><br/>- Nate Clark, Base Camp Coding Academy<br/><br/><i>A must-read for every JavaScript developer wanting to upskill.</i><br/>- Lora Vardarova, CoGo<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297915/",
            "title": "Testing JavaScript Applications",
            "description": "<span>    Automated testing will help you write high-quality software in less time, with more confidence, fewer bugs, and without constant manual oversight. <i>Testing JavaScript Applications</i> is a guide to building a comprehensive and reliable JS application testing suite, covering both how to write tests and how JS testing tools work under the hood. You’ll learn from Lucas de Costa, a core contributor to popular JS testing libraries, as he shares a quality mindset for making testing decisions that deliver a real contribution to your business. You’ll benefit from informative explanations and diagrams, easily-transferable code samples, and useful tips on using the latest and most consolidated libraries and frameworks of the JavaScript ecosystem.<br/><br/><b>About the Technology</b><br/>Automated testing is essential to delivering good JavaScript applications every time. A complete testing strategy needs to cover functions in isolation, integration between different parts of your code, and correctness from the end user’s perspective. This book will teach you how to deliver reliable software quickly and confidently.<br/><br/><b>About the Book</b><br/><i>Testing JavaScript Applications</i> teaches you how to implement an automated testing plan for JavaScript-based web applications. It describes practical testing strategies, covers useful tools and libraries, and explains how to foster a culture of quality.  In this clearly-written, example-rich book, you’ll explore approaches for both backend and frontend applications and learn how to validate your software much more quickly and reliably.<br/><br/><b>What's Inside</b><br/><ul><li>Unit, end-to-end, and integration testing</li><li>Managing test cost and complexity</li><li>Practicing test-driven development</li><li>Dealing with external dependencies</li><li>Tools like Jest and Cypress</li></ul><br/><br/><b>About the Reader</b><br/>For junior JavaScript developers.<br/><br/><b>About the Author</b><br/><b>Lucas da Costa</b> is a core maintainer of Chai and Sinon.JS, two of the most popular testing tools in the JavaScript ecosystem, and contributed to numerous other open-source projects, including Jest.<br/><br/><b>Quotes</b><br/><i>If you thought you knew how to test JavaScript applications, this book will surprise you!</i><br/>- Lucian Enache, Glencore<br/><br/><i>This book is your key to taming the wild frontier of JavaScript testing.</i><br/>- Bryan Miller, Petrolitix<br/><br/><i>A detailed, insightful book on JavaScript testing for newcomers and experienced programmers.</i><br/>- Satej Sahu, Honeywell<br/><br/><i>An up-to-date, practical book that covers the ground level details of writing real-world tests and testing suites.</i><br/>- Raul Siles, DinoSec<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617296178/",
            "title": "Deep Learning with JavaScript",
            "description": "<span>    Deep learning has transformed the fields of computer vision, image processing, and natural language applications. Thanks to TensorFlow.js, now JavaScript developers can build deep learning apps without relying on Python or R. <i>Deep Learning with JavaScript</i> shows developers how they can bring DL technology to the web. Written by the main authors of the TensorFlow library, this new book provides fascinating use cases and in-depth instruction for deep learning apps in JavaScript in your browser or on Node.<br/><br/><b>About the Technology</b><br/>Running deep learning applications in the browser or on Node-based backends opens up exciting possibilities for smart web applications. With the TensorFlow.js library, you build and train deep learning models with JavaScript. Offering uncompromising production-quality scalability, modularity, and responsiveness, TensorFlow.js really shines for its portability. Its models run anywhere JavaScript runs, pushing ML farther up the application stack.<br/><br/><b>About the Book</b><br/>In <i>Deep Learning with JavaScript</i>, you’ll learn to use TensorFlow.js to build deep learning models that run directly in the browser. This fast-paced book, written by Google engineers, is practical, engaging, and easy to follow. Through diverse examples featuring text analysis, speech processing, image recognition, and self-learning game AI, you’ll master all the basics of deep learning and explore advanced concepts, like retraining existing models for transfer learning and image generation.<br/><br/><b>What's Inside</b><br/><ul><li>Image and language processing in the browser</li><li>Tuning ML models with client-side data</li><li>Text and image creation with generative deep learning</li><li>Source code samples to test and modify</li></ul><br/><br/><b>About the Reader</b><br/>For JavaScript programmers interested in deep learning.<br/><br/><b>About the Author</b><br/><b>Shanging Cai</b>, <b>Stanley Bileschi</b> and <b>Eric D. Nielsen</b> are software engineers with experience on the Google Brain team, and were crucial to the development of the high-level API of TensorFlow.js. This book is based in part on the classic, <i>Deep Learning with Python</i> by <b>François Chollet</b>.<br/><br/><b>Quotes</b><br/><i>This book should serve as the authoritative source for readers who want to learn ML and use JavaScript as their main language.</i><br/>- From the Foreword by Nikhil Thorat and Daniel Smilkov, TensorFlow.js<br/><br/><i>Packed with a wealth of information about deep learning, this eminently readable book makes a very strong case for using JavaScript for machine learning.</i><br/>- George Thomas, R&amp;D, Manhattan Associates<br/><br/><i>This book is your guide through the world of deep learning, chauffeured by the very best in their field. You will be amazed at how much it is possible to do in a browser nowadays.</i><br/>- Edin Kapić, iSolutions<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293412/",
            "title": "RxJS in Action",
            "description": "<span><p><i>RxJS in Action</i> gives you the development skills you need to create reactive applications with RxJS. This book is full of theory and practical examples that build on each other and help you begin thinking in a reactive manner.</p><br/><br/><b>About the Technology</b><br/><p>On the web, events and messages flow constantly between UI and server components. With RxJS, you can filter, merge, and transform these streams directly, opening the world of data flow programming to browser-based apps. This JavaScript implementation of the ReactiveX spec is perfect for on-the-fly tasks like autocomplete. Its  asynchronous communication model makes concurrency much, much easier.</p><br/><br/><b>About the Book</b><br/><p><i>RxJS in Action</i> is your guide to building a reactive web UI using RxJS. You'll begin with an intro to stream-based programming as you explore the power of RxJS through practical examples. With the core concepts in hand, you'll tackle production techniques like error handling, unit testing, and interacting with frameworks like React and Redux. And because RxJS builds on ideas from the world of functional programming, you'll even pick up some key FP concepts along the way.</p><br/><br/><b>What's Inside</b><br/><ul><li>Building clean, declarative, fault-tolerant applications</li><li>Transforming and composing streams</li><li>Taming asynchronous processes</li><li>Integrating streams with third-party libraries</li><li>Covers RxJS 5</li></ul><br/><br/><b>About the Reader</b><br/><p>This book is suitable for readers comfortable with JavaScript and standard web application architectures.</p><br/><br/><b>About the Authors</b><br/><p><b>Paul P. Daniels</b> is a professional software engineer with experience in .NET, Java, and JavaScript. <b>Luis Atencio</b> is a software engineer working daily with Java, PHP, and JavaScript platforms, and author of Manning's Functional Programming in JavaScript.</p><br/><br/><b>Quotes</b><br/><i>Important information you need to know in order to become an effective reactive programmer.</i><br/>- From the Foreword by Ben Lesh, Project lead, RxJS 5<br/><br/><i>Covers the subject thoroughly and with great accessibility.</i><br/>- Corinna Cohn, Fusion Alliance<br/><br/><i>All you need to really understand streaming!</i><br/>- Carlos Corutto, Globant<br/><br/><i>Learn to leverage the power of RxJS to build a reactive and resilient foundation for your applications.</i><br/>- Thomas Peklak, Emakina CEE<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294846/",
            "title": "Data Wrangling with JavaScript",
            "description": "<span><p><i>Data Wrangling with JavaScript</i> is hands-on guide that will teach you how to create a JavaScript-based data processing pipeline, handle common and exotic data, and master practical troubleshooting strategies.</p><br/><br/><b>About the Technology</b><br/><p>Why not handle your data analysis in JavaScript? Modern libraries and data handling techniques mean you can collect, clean, process, store, visualize, and present web application data while enjoying the efficiency of a single-language pipeline and data-centric web applications that stay in JavaScript end to end.</p><br/><br/><b>About the Book</b><br/><p><i>Data Wrangling with JavaScript</i> promotes JavaScript to the center of the data analysis stage! With this hands-on guide, you’ll create a JavaScript-based data processing pipeline, handle common and exotic data, and master practical troubleshooting strategies. You’ll also build interactive visualizations and deploy your apps to production. Each valuable chapter provides a new component for your reusable data wrangling toolkit.</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Establishing a data pipeline</li><li>Acquisition, storage, and retrieval</li><li>Handling unusual data sets</li><li>Cleaning and preparing raw data</li><li>Interactive visualizations with D3</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for intermediate JavaScript developers. No data analysis experience required.</p><br/><br/><b>About the Author</b><br/><p><b>Ashley Davis</b> is a software developer, entrepreneur, author, and the creator of Data-Forge and Data-Forge Notebook, software for data transformation, analysis, and visualization in JavaScript.</p><br/><br/><b>Quotes</b><br/><i>A thorough and comprehensive step-by-step guide to managing data with JavaScript.</i><br/>- Ethan Rive<br/><br/><i>Do you still think that you need R and Python skills to do data analysis? This mind-shifting book explains that JavaScript is enough!</i><br/>- Ubaldo Pescatore<br/><br/><i>Does a fantastic job detailing the wrangling process, the tools involved, and the issues and concerns to expect without ever leaving the JavaScript domain.</i><br/>- Alex Basile<br/><br/><i>Excellent real-world examples for full-stack JavaScript developers.</i><br/>- Sai Kota<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292859/",
            "title": "Secrets of the JavaScript Ninja, Second Edition",
            "description": "<span><p><b>GET MORE WITH MANNING</b><br/><br/>An eBook copy of the previous edition, <a href=\"../books/secrets-of-the-javascript-ninja\"><i>Secrets of the JavaScript Ninja (First Edition)</i></a>, is included at no additional cost. It will be automatically added to your Manning account within 24 hours of purchase.</p><hr/><p>More than ever, the web is a universal platform for all types of applications, and JavaScript is the language of the web. If you're serious about web development, it's not enough to be a decent JavaScript coder. You need to be ninja-stealthy, efficient, and ready for anything. This book shows you how.</p><br/><br/><b>About the Technology</b><br/><p>JavaScript is rapidly becoming a universal language for every type of application, whether on the web, on the desktop, in the cloud, or on mobile devices. When you become a JavaScript pro, you have a powerful skill set that's usable across all these domains.</p><br/><br/><b>About the Book</b><br/><p><i>Secrets of the JavaScript Ninja, Second Edition</i> uses practical examples to clearly illustrate each core concept and technique. This completely revised edition shows you how to master key JavaScript concepts such as functions, closures, objects, prototypes, and promises. It covers APIs such as the DOM, events, and timers. You'll discover best practice techniques such as testing, and cross-browser development, all taught from the perspective of skilled JavaScript practitioners.</p><br/><br/><b>What's Inside</b><br/><ul><li>Writing more effective code with functions, objects, and closures</li><li>Learning to avoid JavaScript application pitfalls</li><li>Using regular expressions to write succinct text-processing code</li><li>Managing asynchronous code with promises</li><li>Fully revised to cover concepts from ES6 and ES7</li></ul><br/><br/><b>About the Reader</b><br/><p>You don't have to be a ninja to read this book—just be willing to become one. Are you ready?</p><br/><br/><b>About the Authors</b><br/><p><b>John Resig</b> is an acknowledged JavaScript authority and the creator of the jQuery library. <b>Bear Bibeault</b> is a web developer and author of the first edition, as well as coauthor of <i>Ajax in Practice</i>, <i>Prototype and Scriptaculous in Action</i>, and <i>jQuery in Action</i> from Manning. <b>Josip Maras</b> is a post-doctoral researcher and teacher.</p><br/><br/><b>Quotes</b><br/><i>Essential reading for developers of any discipline ... with powerful techniques to improve your JavaScript.</i><br/>- Becky Huett, Big Shovel Labs<br/><br/><i>Excellent and comprehensive insight into the magic of functions and closures for the efficient use of JavaScript.</i><br/>- Gerd Klevesaat, Siemens<br/><br/><i>The essential resource for moving your JavaScript skills to the next level.</i><br/>- David Starkey, Blum<br/><br/><i>Helps you master both the stealthy and bold techniques of modern JavaScript.</i><br/>- Christopher Haupt, New Relic Inc.<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292828/",
            "title": "Functional Programming in JavaScript",
            "description": "<span><p><i>Functional Programming in JavaScript</i> teaches JavaScript developers functional techniques that will improve extensibility, modularity, reusability, testability, and performance. Through concrete examples and jargon-free explanations, this book teaches you how to apply functional programming to real-life development tasks</p><br/><br/><b>About the Technology</b><br/><p>In complex web applications, the low-level details of your JavaScript code can obscure the workings of the system as a whole. As a coding style, functional programming (FP) promotes loosely coupled relationships among the components of your application, making the big picture easier to design, communicate, and maintain.</p><br/><br/><b>About the Book</b><br/><p><i>Functional Programming in JavaScript</i> teaches you techniques to improve your web applications: their extensibility, modularity, reusability, and testability, as well as their performance. This easy-to-read book uses concrete examples and clear explanations to show you how to use functional programming in real life. If you're new to functional programming, you'll appreciate this guide's many insightful comparisons to imperative or object-oriented programming that help you understand functional design. By the end, you'll think about application design in a fresh new way, and you may even grow to appreciate monads!</p><br/><br/><b>What's Inside</b><br/><ul><li>High-value FP techniques for real-world uses</li><li>Using FP where it makes the most sense</li><li>Separating the logic of your system from implementation details</li><li>FP-style error handling, testing, and debugging</li><li>All code samples use JavaScript ES6 (ES 2015)</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for developers with a solid grasp of JavaScript fundamentals and web application design.</p><br/><br/><b>About the Author</b><br/><b>Luis Atencio</b> (@luijar) is a staff software engineer for Citrix Systems in Fort Lauderdale, Florida. He has a B.S. and an M.S. in computer science and now works full-time developing and architecting applications using JavaScript, Java, and PHP platforms. Luis is very involved in the community and has presented frequently at local meetups and conferences. He blogs about software engineering at <a href=\"http://luisatencio.net\">luisatencio.net</a>, writes articles for magazines and DZone, and is also the coauthor of <i>RxJS in Action </i>(Manning, forthcoming 2017).<br/><br/><b>Quotes</b><br/><i>This book transformed the way that I think about and write JavaScript.</i><br/>- Andrew Meredith, Intrinsitech Corporation<br/><br/><i>Easy to navigate, with real-life examples.</i><br/>- Amy Teng, Dell<br/><br/><i>Now, this is the way to write JavaScript!</i><br/>- William E. Wheeler, West Corporation<br/><br/><i>After reading this book, I revisited how I approached coding and was able to retrain my mind using better methods and techniques.</i><br/>- Tanner Slayton Sr., Microsoft Corporation<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294204/",
            "title": "Get Programming with JavaScript Next",
            "description": "<span><p><i>Get Programming with JavaScript Next</i> introduces the modern age of JavaScript programming with ES6 and ES7 without dragging you through confusing jargon and abstract examples you'll never use. In just 34 quick-fire sessions, you'll quickly be coding with the latest features and functions of ES6 and ES7! </p><br/><br/><b>About the Technology</b><br/><p>Great code is readable, bug-free, and maintainable. Modern JavaScript, aka JavaScript Next, makes it much, much easier to write great applications. New features introduced in ES2015 simplify the structure of your JavaScript projects and radically streamline async-oriented tasks like writing reactive applications and microservices. </p><br/><br/><b>About the Book</b><br/><p>Get Programming with JavaScript Next introduces you to the new features included in the ES2015-and-later JavaScript releases. You'll learn example by example in 34 short lessons, each designed to drive home a specific skill. The coverage is complete: you'll explore new language syntax, declarations, and data types. You'll structure code with modules, replace callbacks with promises, and use classes instead of constructors. Every time you turn a page, complete an exercise, or study a carefully crafted illustration, you'll be one step closer to JavaScript mastery. </p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>New features from ES2015 and later</li><li>Writing asynchronous code</li><li>Creating custom iterables</li><li>Troubleshooting modules and classes </li></ul><br/><br/><b>About the Reader</b><br/><p>Written for web developers comfortable with standard JavaScript 5 features and coding style.</p><br/><br/><b>About the Author</b><br/><p><b>J.D. Isaacks</b> is a seasoned developer, a JavaScript instructor, and an open source maintainer.</p><br/><br/><b>Quotes</b><br/><i>A great resource to quickly get up to speed on everything ES6 and beyond. Everything you need, nothing you don't!</i><br/>- Mike Jensen, UrbanStems<br/><br/><i>A must-read for JS developers who want to be more productive by using the features and functionality of the new ECMAScript.</i><br/>- Ali Naqvi, IBM<br/><br/><i>The language has evolved, and with this book you're ready to evolve with it.</i><br/>- Ethien Daniel Salinas Dominguez, Creze<br/><br/><i>The most comprehensive content that I have seen on JavaScript Next. Highly recommended.</i><br/>- Matteo Gildone, Springer Nature<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293863/",
            "title": "JavaScript on Things",
            "description": "<span><p><i>JavaScript on Things</i> is your first step into the exciting and downright entertaining world of programming for small electronics. If you know enough JavaScript to hack a website together, you'll be making things go bleep, blink, and spin faster than you can say \"nodebot.\"</p><br/><br/><b>About the Technology</b><br/><p>Are you ready to make things move? If you can build a web app, you can create robots, weather stations, and other funky gadgets! In this incredibly fun, project-based guide, JavaScript hardware hacker <b>Lyza Danger Gardner</b> takes you on an incredible journey from your first flashing LED through atmospheric sensors, motorized rovers, Bluetooth doorbells, and more. With JavaScript, some easy-to-get hardware, and a bit of creativity, you'll be beeping, spinning, and glowing in no time.</p><br/><br/><b>About the Book</b><br/><p><i>JavaScript on Things</i> introduces the exciting world of programming small electronics! You'll start building things immediately, beginning with basic blinking on Arduino. This fully illustrated, hands-on book surveys JavaScript toolkits like Johnny-Five along with platforms including Raspberry Pi, Tessel, and BeagleBone. As you build project after interesting project, you'll learn to wire in sensors, hook up motors, transmit data, and handle user input. So be warned: once you start, you won't want to stop.</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Controlling hardware with JavaScript</li><li>Designing and assembling robots and gadgets</li><li>A crash course in electronics</li><li>Over a dozen hands-on projects!</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for readers with intermediate JavaScript and Node.js skills. No experience with electronics required.</p><br/><br/><b>About the Author</b><br/><b>Lyza Danger Gardner</b> has been a web developer for over 20 years. She's part of the NodeBots community and a contributor to the Johnny-Five Node.js library.<br/><br/><b>Quotes</b><br/><i>JavaScript breaks free of the browser with this book!</i><br/>- Amit Lamba, Tech Overture<br/><br/><i>The most accessible and enjoyable book on IoT tech I have ever read.</i><br/>- Andrew Meredith, Quantum Metric<br/><br/><i>Calling all developers! Unlock your inner hardware hacker with this exciting book.</i><br/>- Kevin Liao, Sotheby's<br/><br/><i>Makes developing low-level circuits fun. A pleasure to read!</i><br/>- Earl Bingham, You Technology<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293108/",
            "title": "Get Programming with JavaScript",
            "description": "<span><p><i>Get Programming with JavaScript</i> is a hands-on introduction to programming for readers who have never programmed. You'll be writing your own web apps, games, and programs in no time!</p><br/><br/><b>About the Technology</b><br/><br/><br/><b>About the Book</b><br/><p>Are you ready to start writing your own web apps, games, and programs? You're in the right place! <i>Get Programming with JavaScript</i> is a hands-on introduction to programming for readers who have never written a line of code. Since you're just getting started, this friendly book offers you lots of examples backed by careful explanations. As you go along, you'll find exercises to check your understanding and plenty of opportunities to practice your new skills. You don't need anything special to follow the examples-just the text editor and web browser already installed on your computer. We even give you links to working online code so you can see how everything should look live on your screen.</p><br/><br/><b>What's Inside</b><br/><ul><li>All the basics-objects, functions, responding to users, and more</li><li>Think like a coder and design your own programs</li><li>Create a text-based adventure game</li><li>Enhance web pages with JavaScript</li><li>Run your programs in a web browser</li><li>Four bonus chapters available online</li></ul><br/><br/><b>About the Reader</b><br/>No experience required! All you need is a web browser and an internet connection.<br/><br/><b>About the Author</b><br/><b>John Larsen</b> is a mathematics and computing teacher with an interest in educational research. He has an MA in mathematics and an MSc in information technology. He started programming in 1982, writing simple programs for teaching mathematics in 1993, building websites in 2001, and developing data-driven web-based applications for education in 2006.<br/><br/><b>Quotes</b><br/><i>Provides the guidance you need to get started ..., the support to keep practicing, and the encouragement to enjoy the adventure.</i><br/>- From the Foreword by Remy Sharp, Founder of JS Bin<br/><br/><i>A great book for the new programmer who wants to learn JavaScript.</i><br/>- Alvin Raj, Oracle<br/><br/><i>An approachable and interactive way of learning JavaScript.</i><br/>- Giselle Stidston, Breville Pty Ltd<br/><br/><i>Great interactive code examples! Building a computer game was my favorite part of the book.</i><br/>- Ivan Rubelj, Vipnet<br/><br/></span>",
            "topic": "Javascript"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617296864/",
            "title": "Deep Learning with Python, Second Edition",
            "description": "<span><b>Printed in full color! Unlock the groundbreaking advances of deep learning with this extensively revised new edition of the bestselling original. Learn directly from the creator of Keras and master practical Python deep learning techniques that are easy to apply in the real world.</b><br/><br/>In <i>Deep Learning with Python, Second Edition</i> you will learn:<br/><br/><ul><li>Deep learning from first principles</li><li>Image classification and image segmentation</li><li>Timeseries forecasting</li><li>Text classification and machine translation</li><li>Text generation, neural style transfer, and image generation</li><li>Printed in full color throughout</li></ul><br/><i>Deep Learning with Python</i> has taught thousands of readers how to put the full capabilities of deep learning into action. This extensively revised full color second edition introduces deep learning using Python and Keras, and is loaded with insights for both novice and experienced ML practitioners. You’ll learn practical techniques that are easy to apply in the real world, and important theory for perfecting neural networks.<br/><br/><b>About the Technology</b><br/>Recent innovations in deep learning unlock exciting new software capabilities like automated language translation,  image recognition, and more. Deep learning is quickly becoming essential knowledge for every software developer, and modern tools like Keras and TensorFlow put it within your reach—even if you have no background in mathematics or data science. This book shows you how to get started.<br/><br/><b>About the Book</b><br/><i>Deep Learning with Python, Second Edition</i> introduces the field of deep learning using Python and the powerful Keras library. In this revised and expanded new edition, Keras creator François Chollet offers insights for both novice and experienced machine learning practitioners. As you move through this book, you’ll build your understanding through intuitive explanations, crisp color illustrations, and clear examples. You’ll quickly pick up the skills you need to start developing deep-learning applications.<br/><br/><b>What's Inside</b><br/><ul><li>Deep learning from first principles</li><li>Image classification and image segmentation</li><li>Time series forecasting</li><li>Text classification and machine translation</li><li>Text generation, neural style transfer, and image generation</li><li>Printed in full color throughout</li></ul><br/><br/><b>About the Reader</b><br/>For readers with intermediate Python skills. No previous experience with Keras, TensorFlow, or machine learning is required.<br/><br/><b>About the Author</b><br/><b>François Chollet</b> is a software engineer at Google and creator of the Keras deep-learning library.<br/><br/><b>Quotes</b><br/><i>Chollet is a master of pedagogy and explains complex concepts with minimal fuss, cutting through the math with practical Python code. He is also an experienced ML researcher and his insights on various model architectures or training tips are a joy to read.</i><br/>- Martin Görner, Google<br/><br/><i>Immerse yourself into this exciting introduction to the topic with lots of real-world examples. A must-read for every deep learning practitioner.</i><br/>- Sayak Paul, Carted<br/><br/><i>The modern classic just got better.</i><br/>- Edmon Begoli, Oak Ridge National Laboratory<br/><br/><i>Truly the bible of deep learning.</i><br/>- Yiannis Paraskevopoulos, University of West Attica<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633439160/",
            "title": "Amazon Web Services in Action, Third Edition",
            "description": "<span><b>Master essential best practices for deploying and managing applications on Amazon Web Services. This revised bestseller is packed with techniques for building highly available and scalable architectures and automating deployment with Infrastructure as Code.</b><br/><br/><ul><li>Leverage globally distributed data centers to launch virtual machines with EC2</li><li>Store and archive large volumes of data with EBS, S3, and EFS</li><li>Persist and query data with highly available and scalable database systems with RDS and DynamoDB</li><li>Enhance performance with caching data in-memory with ElastiCache and MemoryDB</li><li>Use Infrastructure as Code to automate your cloud infrastructure</li><li>Secure workloads running in the cloud with VPC and IAM</li><li>Build fault-tolerant web applications with ALB and SQS</li><li>Automate common sysadmin tasks with Lambda, CLI, and SDK</li><li>Build cloud-native applications based on containers with AppRunner, ECS, Fargate</li></ul><br/> Thousands of developers have chosen <i>Amazon Web Services in Action: An in-depth guide to AWS</i> to help them succeed with the AWS cloud. Readers love this all-practical handbook for its complete introduction to computing, storage, and networking, along with best practices for all core AWS services. This revised third edition features new chapters on containerization, along with a variety of AWS innovations. You’ll also learn how automating your infrastructure with IAC is a game changer for your cloud deployment, delivering a massive boost to efficiency and quality.<br/><br/><b>About the Technology</b><br/>Amazon Web Services, the leading cloud computing platform, offers customers APIs for on-demand access to computing services. Rich in examples and best practices of how to use AWS, this Manning bestseller is now released in its third, revised, and improved edition.<br/><br/><b>About the Book</b><br/>In <i>Amazon Web Services in Action, Third Edition: An in-depth guide to AWS</i>, the Wittig brothers give you a comprehensive, practical introduction to deploying and managing applications on the AWS cloud platform. With a sharp focus on the most important AWS tasks and services, they will save you hours of unproductive time. You’ll learn hands-on as you complete real-world projects like hosting a WordPress site, setting up a private cloud, and deploying an app on containers.<br/><br/><b>What's Inside</b><br/><ul><li>Leverage globally distributed data centers to launch virtual machines</li><li>Enhance performance with caching data in-memory</li><li>Secure workloads running in the cloud with VPC and IAM</li><li>Build fault-tolerant web applications with ALB and SQS</li></ul><br/><br/><b>About the Reader</b><br/>Written for mid-level developers, DevOps or platform engineers, architects, and system administrators.<br/><br/><b>About the Author</b><br/><b>Andreas Wittig</b> and <b>Michael Wittig</b> are software engineers and consultants focused on AWS. Together, they migrated the first bank in Germany to AWS in 2013.<br/><br/><b>Quotes</b><br/><i>Up-to-date coverage. Code examples and configurations are all excellent. Even containerization is very well explained. This is the bible for Amazon Web Services.</i><br/>- Mohammad Shahnawaz Akhter, Bank of America<br/><br/><i>It has never been so easy to learn AWS.</i><br/>- Jorge Ezequiel Bo, TravelX<br/><br/><i>Essential for those who decide to embark on the Amazon cloud journey.</i><br/>- Matteo Rossi, UnipolSai Assicurazioni<br/><br/><i>A complete introduction to the most important AWS Services with very useful practical examples.</i><br/>- Matteo Battista, GamePix<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617298691/",
            "title": "Spring Start Here",
            "description": "<span><b>Quickly master the massive Spring ecosystem with this focused, hands-on guide that teaches you exactly what you need to know.</b><br/><br/>In <i>Spring Start Here</i>, you will learn how to:<br/><br/><ul><li>Build web applications with Spring</li><li>Manage application objects with Spring context</li><li>Implement data persistence using data sources and transactions</li><li>Implement data exchange between applications using REST services</li><li>Utilize Spring Boot's convention-over-configuration approach</li><li>Write unit and integration tests for apps implemented with Spring</li><li>Minimize work when building any kind of app</li><li>Persisting data in a Spring application using the latest approach</li></ul><br/><i>Spring Start Here</i> introduces you to Java development with Spring by concentrating on the core concepts you'll use in every application you build. You'll learn how to refactor an existing application to Spring, how to use Spring tools to make SQL database requests and REST calls, and how to secure your projects with Spring Security. There's always more to learn, and this book will make your next steps much easier.<br/><br/><b>About the Technology</b><br/>For Java developers, Spring is the must-learn framework. This incredible development tool powers everything from small business ecommerce applications to enterprise-scale microservices. Mastering Spring is a long journey. Taking your first step is easy! Start here.<br/><br/><b>About the Book</b><br/><i>Spring Start Here</i> teaches Java developers how to build applications using Spring framework. Informative graphics, relevant examples, and author Laurenţiu Spilcă's clear and lively writing make it easy to pick up the skills you need. You'll discover how to plan, write, and test applications. And by concentrating on the most important features, this no-nonsense book gives you a firm foundation for exploring Spring's rich ecosystem.<br/><br/><b>What's Inside</b><br/><ul><li>Build web applications with Spring</li><li>Minimize repetition and manual work</li><li>Persisting data in a Spring application</li><li>HTTP and REST-based web services</li><li>Testing your Spring implementations</li></ul><br/><br/><b>About the Reader</b><br/>For readers with beginner to intermediate Java skills.<br/><br/><b>About the Author</b><br/><b>Laurențiu Spilcă</b> is a skilled Java and Spring developer and an experienced technology instructor.<br/><br/><b>Quotes</b><br/><i>Takes you on a quick, entertaining, and pragmatic journey into the world of Spring.</i><br/>- Christian Kreutzer-Beck, ARAG IT<br/><br/><i>A well-written and thorough introduction to Spring and Spring Boot.</i><br/>- Jim Welch, Equifax Workforce Solutions<br/><br/><i>Fantastically pragmatic resource on Spring framework fundamentals.</i><br/>- Andrew Oswald, Chariot Solutions<br/><br/><i>A great resource for individuals looking to bridge the gap from student to professional developer. A solid introduction to Spring.</i><br/>- Daniel Carl, Oatey Co.<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633438620/",
            "title": "ASP.NET Core in Action, Third Edition",
            "description": "<span><b>Build professional-grade full-stack web applications using C# and ASP.NET Core.  </b><br/><br/>In <i>ASP.NET Core in Action, Third Edition</i> you’ll learn how to:<br/><br/><ul><li>Build minimal APIs for serving JSON to client-side applications</li><li>Create dynamic, server-side rendered applications using Razor Pages </li><li>User authentication and authorization </li><li>Store data using Entity Framework Core</li><li>Unit and integration tests for ASP.NET Core applications</li><li>Write custom middleware and components</li></ul><br/><b>Fully updated to ASP.NET Core 7.0!</b> In <i>ASP.NET Core in Action, Third Edition</i> Microsoft MVP Andrew Lock teaches you how you can use your C# and .NET skills to build amazing cross-platform web applications. This revised bestseller reveals the latest .NET patterns, including minimal APIs and minimal hosting. Even if you've never worked with ASP.NET, you'll start creating productive cross-platform web apps fast. Illustrations and annotated code make learning visual and easy.<br/><br/><b>About the Technology</b><br/>The ASP.NET Core web framework delivers everything you need to build professional-quality web applications. With productivity-boosting libraries for server-side rendering, secure APIs, easy data access and more, you’ll spend your time implementing features instead of researching syntax and tracking down bugs. This book is your guide.<br/><br/><b>About the Book</b><br/><i>ASP.NET Core in Action, Third Edition</i> shows you how to create production-grade web applications with ASP.NET Core 7.0. You’ll learn from hands-on examples, insightful illustrations, and nicely explained code. Updated coverage in this Third Edition includes creating minimal APIs, securing APIs with bearer tokens, WebApplicationBuilder, and more.<br/><br/><b>What's Inside</b><br/><ul><li>Minimal APIs for serving JSON</li><li>Server-side rendering using Razor Pages</li><li>Data access with Entity Framework Core</li><li>Write custom middleware and components</li></ul><br/><br/><b>About the Reader</b><br/>For beginning to intermediate web developers. Examples are in C#.<br/><br/><b>About the Author</b><br/><b>Andrew Lock</b> is a Microsoft MVP who has worked with ASP.NET Core since before its first release.<br/><br/><b>Quotes</b><br/><i>ASP.NET Core is a big subject. Luckily, there’s a big book! This is my ASP.NET bible.</i><br/>- Peter Morris, Author of blazor-university.com<br/><br/><i>Masterfully breaks down web programming. This book is a must-read for new and experienced developers alike. It sets the standard in the .NET space.</i><br/>- Khalid Abuhakmeh, JetBrains<br/><br/><i>Andrew Lock’s extensive experience and applied advice will truly take any .NET web developer from zero to hero.</i><br/>- James Hickey, Savvyy Technologies<br/><br/><i>Fantastic information to help you make the best applications possible. This book stays on my desk.</i><br/>- Foster Haines, Foster's Website Company<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617298875/",
            "title": "The Well-Grounded Java Developer, Second Edition",
            "description": "<span><b>Understanding Java from the JVM up gives you a solid foundation to grow your expertise and take on advanced techniques for performance, concurrency, containerization, and more.</b><br/><br/>In <i>The Well-Grounded Java Developer, Second Edition</i> you will learn:<br/><br/><ul><li>The new Java module system and why you should use it</li><li>Bytecode for the JVM, including operations and classloading</li><li>Performance tuning the JVM</li><li>Working with Java’s built-in concurrency and expanded options</li><li>Programming in Kotlin and Clojure on the JVM</li><li>Maximizing the benefits from your build/CI tooling with Maven and Gradle</li><li>Running the JVM in containers</li><li>Planning for future JVM releases</li></ul><br/><i>The Well-Grounded Java Developer, Second Edition</i> introduces both the modern innovations and timeless fundamentals you need to know to become a Java master. Authors Ben Evans, Martijn Verburg, and Jason Clark distill their decades of experience as Java Champions, veteran developers, and key contributors to the Java ecosystem into this clear and practical guide. You’ll discover how Java works under the hood and learn design secrets from Java’s long history. Each concept is illustrated with hands-on examples, including a fully modularized application/library and creating your own multithreaded application.<br/><br/><b>About the Technology</b><br/>Java is the beating heart of enterprise software engineering. Developers who really know Java can expect easy job hunting and interesting work. Written by experts with years of boots-on-the-ground experience, this book upgrades your Java skills. It dives into powerful features like modules and concurrency models and even reveals some of Java’s deep secrets.<br/><br/><b>About the Book</b><br/>With <i>The Well-Grounded Java Developer, Second Edition</i> you will go beyond feature descriptions and learn how Java operates at the bytecode level. Master high-value techniques for concurrency and performance optimization, along with must-know practices for build, test, and deployment. You’ll even look at alternate JVM languages like Kotlin and Clojure. Digest this book and stand out from the pack.<br/><br/><b>What's Inside</b><br/><ul><li>The new Java module system</li><li>Performance tuning the JVM</li><li>Maximizing CI/CD with Maven and Gradle</li><li>Running the JVM in containers</li><li>Planning for future JVM releases</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Java developers.<br/><br/><b>About the Authors</b><br/><b>Benjamin J. Evans</b> is a senior principal engineer at Red Hat. <b>Martijn Verburg</b> is the principal SWE manager for Microsoft’s Java Engineering Group. Both Benjamin and Martijn are Java Champions. <b>Jason Clark</b> is a principal engineer and architect at New Relic.<br/><br/><b>Quotes</b><br/><i>Ben, Jason, and Martijn have done a fantastic job with this book. Take advantage of their collective wisdom.</i><br/>- From the Foreword by Heinz Kabutz, The Java Specialists’ Newsletter<br/><br/><i>True to its name, it introduces and reinforces concepts from language level down to the JVM bytecode.</i><br/>- Yogesh Shetty, ING Bank<br/><br/><i>Great information...a worthy update.</i><br/>- Michael Wall, Wall Technology Consulting<br/><br/><i>A deep dive into modern Java and JVM-based languages.</i><br/>- Gilberto Taccari, faire.ai<br/><br/><i>A must-read for every Java developer, including seasoned ones!</i><br/>- Jean-François Morin, Laval University<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617298424/",
            "title": "Cloud Native Spring in Action",
            "description": "<span><b>Build and deliver production-grade cloud-native apps with Spring framework and Kubernetes. </b><br/><br/>In <i>Cloud Native Spring in Action</i> you’ll learn:<br/><br/><ul><li>Cloud native best practices and design patterns</li><li>Build and test cloud native apps with Spring Boot and Spring Cloud</li><li>Handle security, resilience, and scalability in imperative and reactive applications</li><li>Configure, deploy, and observe applications on Kubernetes</li><li>Continuous delivery and GitOps to streamline your software lifecycle </li></ul><br/><i>Cloud Native Spring in Action</i> is a practical guide to building applications that are designed for cloud environments. You’ll learn effective Spring and Kubernetes cloud development techniques that you can immediately apply to enterprise-grade applications. Follow a detailed and complete cloud native system from first concept right through to production and deployment, learning best practices, design patterns, and little-known tips and tricks for pain-free cloud native development. Including coverage of security, continuous delivery, and configuration, this hands-on guide is the perfect primer for navigating the increasingly complex cloud landscape.<br/><br/><b>About the Technology</b><br/>Do you want to learn how to build scalable, resilient, and observable Spring applications that take full advantage of the cloud computing model? If so, <i>Cloud Native Spring in Action</i> is the book for you! It will teach you the essential techniques and practices you need to build efficient Spring Boot applications ready for production in the cloud.<br/><br/><b>About the Book</b><br/>In <i>Cloud Native Spring in Action</i>, you’ll learn how to containerize your Spring Boot applications with Cloud Native Buildpacks and deploy them on Kubernetes. This practical guide delivers unique insights into hosting microservices, serverless applications, and other modern architectures on cloud platforms. You’ll learn how to use Spring-based methodologies, practices, and patterns that you won’t find anywhere else.<br/><br/><b>What's Inside</b><br/><ul><li>Implement cloud native patterns with Spring</li><li>Handle security, resilience, and scalability</li><li>Build and test imperative and reactive applications</li><li>Configuration and observability on Kubernetes</li><li>Adopt continuous delivery and GitOps</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Java developers.<br/><br/><b>About the Author</b><br/><b>Thomas Vitale</b> is a software engineer, open source contributor, and international conference speaker.<br/><br/><b>Quotes</b><br/><i>This book is fantastic. It’s brimming with valuable ideas couched in evident, profound experience. I will be pointing people to this book for the foreseeable future.</i><br/>- From the Foreword by Josh Long, Spring Developer Advocate, VMware<br/><br/><i>One of the best I’ve read. I now feel qualified to begin moving applications to a cloud-native architecture.</i><br/>- Steve Rogers, CGTek<br/><br/><i>An essential resource for creating the next generation of enterprise apps.</i><br/>- Conor Redmond, InComm Payments<br/><br/><i>A welcome collection of insights on building and deploying microservices across various domains.</i><br/>- George Thomas, Manhattan Associates<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299186/",
            "title": "Java Persistence with Spring Data and Hibernate",
            "description": "<span><b>Master Java persistence using the industry-leading tools Spring Data and Hibernate.</b><br/><br/>In <i>Java Persistence with Spring Data and Hibernate</i> you will learn:<br/><br/><ul><li>Mapping persistent classes, value types, and inheritance</li><li>Mapping collections and entity associations</li><li>Processing transactions with Spring Data and Hibernate</li><li>Creating fetch plans, strategies, and profiles</li><li>Filtering data</li><li>Building Spring Data REST projects</li><li>Using Java persistence with non-relational databases</li><li>Querying JPA with QueryDSL</li><li>Testing Java persistence applications</li></ul><br/><i>Java Persistence with Spring Data and Hibernate</i> teaches you the ins-and-outs of Java persistence with hands-on examples using Spring Data, JPA, and Hibernate. The book carefully analyzes the capabilities of the major Java persistence tools, and guides you through the most common use cases. By comparing and contrasting the alternatives, you’ll find it easy to choose the right tool choice for your applications. You’ll learn how to make and utilize mapping strategies, about the different approach to transactions for both Hibernate and Spring Data, and even how to efficiently test Java persistence applications. The practical techniques are demonstrated with both relational and non-relational databases.<br/><br/><b>About the Technology</b><br/>Effectively managing application data is essential for any serious application. Spring Data and Hibernate bridge the gap between object-oriented code and relational data stores, radically simplifying Java persistence. By implementing the Java Persistence API (JPA) standard, these powerful tools help you avoid common bugs related to state and application data storage.<br/><br/><b>About the Book</b><br/><i>Java Persistence with Spring Data and Hibernate</i> explores Java persistence using industry-standard tools. Hands-on examples introduce object-relational mapping and guide you through different mapping strategies to suit your needs. Covering transactions, persistent application testing, and non-relational databases, this book is your go-to resource for managing data in Java applications.<br/><br/><b>What's Inside</b><br/><ul><li>Mapping persistent classes, value types, and inheritance</li><li>Creating fetch plans, strategies, and profiles</li><li>Building Spring Data REST projects</li><li>Querying JPA with QueryDSL</li></ul><br/><br/><b>About the Reader</b><br/>For intermediate Java programmers.<br/><br/><b>About the Author</b><br/><b>Cătălin Tudose</b> has more than 20 years of experience in the Java community. <b>Christian Bauer</b>, <b>Gavin King</b>, and <b>Gary Gregory</b> are the authors of <i>Java Persistence with Hibernate, Second Edition</i>, on which this book is based.<br/><br/><b>Quotes</b><br/><i>Everything you need to work effectively with Hibernate and Spring Data. A must-read for all Java developers!</i><br/>- From the Foreword by Dmitry Aleksandrov, Oracle Software Developer and Java Champion<br/><br/><i>It is an honor to recommend this book. I hope that it will assist you in producing performant, secure, testable software that others may rely on with confidence.</i><br/>- From the Foreword by Mohamed Taman, Chief Solutions Architect at Nortal and Java Champion<br/><br/><i>A pedagogical gem. Engaging and pragmatic. It’s like holding a conversation with a Hibernate expert.</i><br/>- Nathan B Crocker, Galaxy Digita<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299599/",
            "title": "100 Go Mistakes and How to Avoid Them",
            "description": "<span><b>Spot errors in your Go code you didn’t even know you were making and boost your productivity by avoiding common mistakes and pitfalls.</b><br/><br/><i>100 Go Mistakes and How to Avoid Them</i> shows you how to:<br/><br/><ul><li>Dodge the most common mistakes made by Go developers</li><li>Structure and organize your Go application</li><li>Handle data and control structures efficiently</li><li>Deal with errors in an idiomatic manner</li><li>Improve your concurrency skills</li><li>Optimize your code</li><li>Make your application production-ready and improve testing quality</li></ul><br/><i>100 Go Mistakes and How to Avoid Them</i> puts a spotlight on common errors in Go code you might not even know you’re making. You’ll explore key areas of the language such as concurrency, testing, data structures, and more—and learn how to avoid and fix mistakes in your own projects. As you go, you’ll navigate the tricky bits of handling JSON data and HTTP services, discover best practices for Go code organization, and learn how to use slices efficiently.<br/><br/><b>About the Technology</b><br/>Understanding mistakes is the best way to improve the quality of your code. This unique book examines 100 bugs and inefficiencies common to Go applications, along with tips and techniques to avoid making them in your own projects.<br/><br/><b>About the Book</b><br/><i>100 Go Mistakes and How to Avoid Them</i> shows you how to replace common programming problems in Go with idiomatic, expressive code. In it, you’ll explore dozens of interesting examples and case studies as you learn to spot mistakes that might appear in your own applications. Expert author Teiva Harsanyi organizes the error avoidance techniques into convenient categories, ranging from types and strings to concurrency and testing.<br/><br/><b>What's Inside</b><br/><ul><li>Identify and squash code-level bugs</li><li>Avoid problems with application structure and design</li><li>Perfect your data and control structures</li><li>Optimize your code by eliminating inefficiencies</li></ul><br/><br/><b>About the Reader</b><br/>For developers proficient with Go programming and syntax.<br/><br/><b>About the Author</b><br/><b>Teiva Harsanyi</b> is a senior software engineer at Docker with experience in various domains, including safety-critical industries like air traffic management.<br/><br/><b>Quotes</b><br/><i>Required reading for Go developers before they touch code in production. It’s the Go equivalent of Effective Java.</i><br/>- Neeraj Shah, Nutanix<br/><br/><i>Clear and effective examples. Armed with the understanding of how and why mistakes occur, you’re equipped to avoid costly errors.</i><br/>- Giuseppe Maxia, Vmware<br/><br/><i>Teiva Harsanyi catalogs real problems and easy-to-miss ‘gotchas,’ and delves into the nuanced world of why they happen. Not having this book will be your 101st mistake.</i><br/>- Anupam Sengupta, Red Hat<br/><br/><i>Learn good habits by identifying bad ones. The writing is engaging, the examples relevant, and the insights useful.</i><br/>- Thad Meyer, LI-COR Biosciences<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633439481/",
            "title": "Building Web APIs with ASP.NET Core",
            "description": "<span><b>Build fully-featured APIs with ASP.NET Core! This all-practical guide is written like a real development project, taking you hands-on with modern APIs utilizing REST and GraphQL standards.</b><br/><br/>In <i>Building Web APIs with ASP.NET Core</i> you will learn how to:<br/><br/><ul><li>Set up your environment with VS 2022, Node, Git, and more</li><li>Create a ASP.NET Core project from scratch</li><li>Integrate with SQL Server</li><li>Use Entity Framework Core to set up a data model</li><li>Create back-end controllers</li><li>Design an API to serve data</li><li>Write API documentation using Swagger and Swashbuckle</li><li>Consume an API using typical web client-side frameworks</li><li>Handle requests and routes using controllers and Minimal API</li><li>Release and deploy your Web API in production on cloud-based hosting services such as MS Azure</li></ul><br/><i>Building Web APIs with ASP.NET Core</i> is a practical beginner’s guide to creating your first web APIs using ASP.NET Core. In it, you’ll develop an API that feeds web-based services, including websites and mobile apps, for a board games application. The book is cleverly structured to mirror a real-world development project, with each chapter introducing a new feature request. You’ll build your API with an ecosystem of ASP.NET Core tools that help simplify everything from setting up your data model to generating documentation.<br/><br/><b>About the Technology</b><br/>Web APIs are the front door to an application, providing controlled access to its data and features. ASP.NET Core, Microsoft’s web framework, simplifies and accelerates API creation with powerful, developer-friendly features, including an innovative “no compile” coding experience. It is reliable, fast, free, open-source, and backed by Microsoft’s legendary support.<br/><br/><b>About the Book</b><br/><i>Building Web APIs with ASP.NET Core</i> teaches you how to write safe, maintainable, and performant REST APIs. It’s full of best practices for modern and classic API styles, including REST and GraphQL. You’ll love the groundbreaking Minimal API model that helps you build pro-quality APIs with just a few lines of code. Each chapter contains realistic user stories, backlog items, and development tasks.<br/><br/><b>What's Inside</b><br/><ul><li>Create an ASP.NET Core project from scratch</li><li>Set up a data model with Entity Framework Core</li><li>Create backend controllers</li><li>Design an API to serve data</li></ul><br/><br/><b>About the Reader</b><br/>For developers with some experience using the .NET Framework.<br/><br/><b>About the Author</b><br/><b>Valerio De Sanctis</b> has more than 20 years of experience in web development and project management using ASP.NET, PHP, and Java.<br/><br/><b>Quotes</b><br/><i>Great blend of foundational and advanced concepts and techniques.</i><br/>- Darren Gillis, BlackLabel Digital<br/><br/><i>REST, authentication/authorization, validation, and even documentation are all covered in one place. This is the book you’re looking for!</i><br/>- Paul Brown, VacoBuilt<br/><br/><i>Fantastic! Provides realistic examples and gets the reader comfortable quickly with API development.</i><br/>- Foster Haines, J2 Interactive<br/><br/><i>I like the pragmatic way to learn by building a real ASP.NET Core API.</i><br/>- Enzo Aggazio, SCAI Lab<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297205/",
            "title": "Data Analysis with Python and PySpark",
            "description": "<span><b>Think big about your data! PySpark brings the powerful Spark big data processing engine to the Python ecosystem, letting you seamlessly scale up your data tasks and create lightning-fast pipelines.</b><br/><br/>In <i>Data Analysis with Python and PySpark</i> you will learn how to:<br/><br/><ul><li>Manage your data as it scales across multiple machines</li><li>Scale up your data programs with full confidence</li><li>Read and write data to and from a variety of sources and formats</li><li>Deal with messy data with PySpark’s data manipulation functionality</li><li>Discover new data sets and perform exploratory data analysis</li><li>Build automated data pipelines that transform, summarize, and get insights from data</li><li>Troubleshoot common PySpark errors</li><li>Creating reliable long-running jobs</li></ul><br/><i>Data Analysis with Python and PySpark</i> is your guide to delivering successful Python-driven data projects. Packed with relevant examples and essential techniques, this practical book teaches you to build pipelines for reporting, machine learning, and other data-centric tasks. Quick exercises in every chapter help you practice what you’ve learned, and rapidly start implementing PySpark into your data systems. No previous knowledge of Spark is required.<br/><br/><b>About the Technology</b><br/>The Spark data processing engine is an amazing analytics factory: raw data comes in, insight comes out. PySpark wraps Spark’s core engine with a Python-based API. It helps simplify Spark’s steep learning curve and makes this powerful tool available to anyone working in the Python data ecosystem.<br/><br/><b>About the Book</b><br/><i>Data Analysis with Python and PySpark</i> helps you solve the daily challenges of data science with PySpark. You’ll learn how to scale your processing capabilities across multiple machines while ingesting data from any source—whether that’s Hadoop clusters, cloud data storage, or local data files. Once you’ve covered the fundamentals, you’ll explore the full versatility of PySpark by building machine learning pipelines, and blending Python, pandas, and PySpark code.<br/><br/><b>What's Inside</b><br/><ul><li>Organizing your PySpark code</li><li>Managing your data, no matter the size</li><li>Scale up your data programs with full confidence</li><li>Troubleshooting common data pipeline problems</li><li>Creating reliable long-running jobs</li></ul><br/><br/><b>About the Reader</b><br/>Written for data scientists and data engineers comfortable with Python.<br/><br/><b>About the Author</b><br/>As a ML director for a data-driven software company, <b>Jonathan Rioux</b> uses PySpark daily. He teaches the software to data scientists, engineers, and data-savvy business analysts.<br/><br/><b>Quotes</b><br/><i>A clear and in-depth introduction for truly tackling big data with Python.</i><br/>- Gustavo Patino, Oakland University William Beaumont School of Medicine<br/><br/><i>The perfect way to learn how to analyze and master huge datasets.</i><br/>- Gary Bake, Brambles<br/><br/><i>Covers both basic and more advanced topics of PySpark, with a good balance between theory and hands-on.</i><br/>- Philippe Van Bergenl, P² Consulting<br/><br/><i>For beginner to pro, a well-written book to help understand PySpark.</i><br/>- Raushan Kumar Jha, Microsoft<br/><br/></span>",
            "topic": "Machine_Learning"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633439825/",
            "title": "Tiny C Projects",
            "description": "<span><b>Learn the big skills of C programming by creating bite-size projects! Work your way through these 15 fun and interesting tiny challenges to master essential C techniques you’ll use in full-size applications.</b><br/><br/>In <i>Tiny C Projects</i> you will learn how to:<br/><br/><ul><li>Create libraries of functions for handy use and re-use</li><li>Process input through an I/O filter to generate customized output</li><li>Use recursion to explore a directory tree and find duplicate files</li><li>Develop AI for playing simple games</li><li>Explore programming capabilities beyond the standard C library functions</li><li>Evaluate and grow the potential of your programs</li><li>Improve code to better serve users</li></ul><br/><i>Tiny C Projects</i> is an engaging collection of 15 small programming challenges! This fun read develops your C abilities with lighthearted games like tic-tac-toe, utilities like a useful calendar, and thought-provoking exercises like encoding and cyphers. Jokes and lighthearted humor make even complex ideas fun to learn. Each project is small enough to complete in a weekend, and encourages you to evolve your code, add new functions, and explore the full capabilities of C.<br/><br/><b>About the Technology</b><br/>The best way to gain programming skills is through hands-on projects—this book offers 15 of them. C is required knowledge for systems engineers, game developers, and roboticists, and you can start writing your own C programs today. Carefully selected projects cover all the core coding skills, including storing and modifying text, reading and writing files, searching your computer’s directory system, and much more.<br/><br/><b>About the Book</b><br/><i>Tiny C Projects</i> teaches C gradually, from project to project. Covering a variety of interesting cases, from timesaving tools, simple games, directory utilities, and more, each program you write starts out simple and gets more interesting as you add features. Watch your tiny projects grow into real applications and improve your C skills, step by step.<br/><br/><b>What's Inside</b><br/><ul><li>Caesar cipher solver: Use an I/O filter to generate customized output</li><li>Duplicate file finder: Use recursion to explore a directory tree</li><li>Daily greetings: Writing the moon phase algorithm</li><li>Lotto pics: Working with random numbers</li></ul><br/>And 11 more fun projects!<br/><br/><b>About the Reader</b><br/>For C programmers of all skill levels.<br/><br/><b>About the Author</b><br/><b>Dan Gookin</b> has over 30 years of experience writing about complex topics. His most famous work is DOS For Dummies, which established the entire For Dummies brand.<br/><br/><b>Quotes</b><br/><i>A ‘learning by playing’ approach to C! For me, it was a joyful return to the roots.</i><br/>- Maciej Jurkowski, Grupa Pracuj<br/><br/><i>Dan blends the serious and amusing parts of C into a comfortable, gradual ladder of knowledge. No one else can write a book like this.</i><br/>- Joe Tingsanchali, Sonar<br/><br/><i>I highly recommend to all of my colleagues who need to speed up slow Python code.</i><br/>- Marco Carnini, Features Analytics<br/><br/><i>Excellent for anyone who wants to learn or relearn C. Highly recommended.</i><br/>- Nathan McKinley-Pace, George Mason University<br/><br/><i>If you’ve never worked with C, or it’s been a long time since you have, this is an excellent book.</i><br/>- Chris Kolosiwsky, Globality<br/><br/></span>",
            "topic": "C++"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617295812/",
            "title": "Modern C",
            "description": "<span><i>Modern C</i> focuses on the new and unique features of modern C programming. The book is based on the latest C standards and offers an up-to-date perspective on this tried-and-true language.<br/><br/><b>About the Technology</b><br/>C is extraordinarily modern for a 50-year-old programming language. Whether you’re writing embedded code, low-level system routines, or high-performance applications, C is up to the challenge. This unique book, based on thelatest C standards, exposes a modern perspective of this tried-and-true language.<br/><br/><b>About the Book</b><br/><i>Modern C</i> introduces you to modern day C programming, emphasizing the unique and new features of this powerful language. For new C coders, it starts with fundamentals like structure, grammar, compilation, and execution. From there, you’ll advance to control structures, data types, operators, and functions, as you gain a deeper understanding of what’s happening under the hood. In the final chapters, you’ll explore performance considerations, reentrancy, atomicity, threads, and type-generic programming. You’ll code as you go with concept-reinforcing exercises and skill-honing challenges along the way.<br/><br/><b>What's Inside</b><br/><ul><li>Operators and functions</li><li>Pointers, threading, and atomicity</li><li>C’s memory model</li><li>Hands-on exercises</li></ul><br/><br/><b>About the Reader</b><br/>For programmers comfortable writing simple programs in a language like Java, Python, Ruby, C#, C++, or C.<br/><br/><b>About the Author</b><br/><b>Jens Gustedt</b> is a senior scientist at the French National Institute for Computer Science and Control (INRIA) and co-editor of the ISO C standard.<br/><br/><b>Quotes</b><br/><i>Great introductory material to the ‘new’ C. This isn’t your grandfather’s C anymore!</i><br/>- Hugo Durana, Microsoft<br/><br/><i>Reading and working through this book is just like having an expert by your side.</i><br/>- Glen Sirakavit, Data Recognition<br/><br/><i>The most authoritative book on C since Kernighan and Ritchie. A must-have on the shelves of all C programmers.</i><br/>- Manu Raghavan Sareena, Arm<br/><br/><i>The definitive guide to learning modern C.</i><br/>- Sanchir Kartiev, Emerline<br/><br/></span>",
            "topic": "C++"
        },
                {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299896/",
            "title": "Go by Example",
            "description": "<span><b>Go beyond Go syntax into the language’s unique perspective on program design.</b><br/><br/>Through engaging hands-on examples, <i>Go by Example</i> will teach you to think differently about programming in Go. You’ll get to grips with the “Go mindset”, writing code that’s simple, straightforward, and easy to understand for your fellow Go developers. You’ll discover how Go’s tooling helps you write code that’s robust and testable, and see just how productive you can be with Go's rich set of built-in packages.<br/><br/>In <i>Go by Example</i> you will learn how to:<br/><br/><ul><li>Understand what makes Go different and adopt its philosophy for simple, pragmatic, and straightforward code</li><li>Write idiomatic code that’s robust, efficient, maintainable, and inherently testable by design</li><li>Identify common Go mistakes and apply proven patterns for higher quality code</li><li>Structure and organize effective Go packages and APIs</li><li>Build performant concurrent programs with Go’s unique concurrency</li></ul><br/><i>Go by Example</i> explores what makes Go so dramatically different from other languages. Through hands-on and realistic project examples—like command-line tools, web services, and scalable concurrent programs—it helps experienced developers unlearn habits and quickly become productive in crafting truly Go-like, high-quality code.<br/><br/><b>About the Technology</b><br/>You can’t appreciate the simplicity, explicitness, and pragmatism of Go until you see it with your own eyes! Even a quick glance at an elegant interface or a bit of clean error handling code reveals why Go was the language of choice for Kubernetes, Docker, and Terraform.<br/><br/><b>About the Book</b><br/><i>Go by Example</i> unpacks real Go programs to highlight the language features and idiomatic coding practices used by the pros. In it, you’ll dissect and explore examples of command-line tools, concurrent programs, web services, and more as you learn to write Go code that’s simple, efficient, and testable.<br/><br/><b>What's Inside</b><br/><ul><li>Acquire the “Go mindset”</li><li>Write idiomatic, reliable, and maintainable code</li><li>Structure Go projects and packages</li><li>Best practices and antipatterns</li></ul><br/><br/><b>About the Reader</b><br/>For experienced programmers.<br/><br/><b>About the Author</b><br/><b>Inanc Gumus</b> is a veteran programmer who has specialized in Go since 2012. Inanc has educated over 100,000 developers through his social presence, GitHub repositories, online courses, and his popular blog.<br/><br/><b>Quotes</b><br/><i>Teaches you all the important bits using realistic code.</i><br/>- Mat Ryer, Grafana Labs<br/><br/><i>A goldmine of practical examples and insightful explanations.</i><br/>- Paul Snow, JDR Software<br/><br/><i>Covers modern Go features thoughtfully, weaving them into solutions as natural parts of well-crafted code.</i><br/>- Kemal Akkoyun, Datadog<br/><br/><i>Invaluable for anyone wishing to take their Go coding to the next level.</i><br/>- Barnaby Norman, Direct Corporate Clothing Limited<br/><br/><i>Complete, practical and clear Go knowledge in a pill!</i><br/>- Bartłomiej Płotka, Google<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617299599/",
            "title": "100 Go Mistakes and How to Avoid Them",
            "description": "<span><b>Spot errors in your Go code you didn’t even know you were making and boost your productivity by avoiding common mistakes and pitfalls.</b><br/><br/><i>100 Go Mistakes and How to Avoid Them</i> shows you how to:<br/><br/><ul><li>Dodge the most common mistakes made by Go developers</li><li>Structure and organize your Go application</li><li>Handle data and control structures efficiently</li><li>Deal with errors in an idiomatic manner</li><li>Improve your concurrency skills</li><li>Optimize your code</li><li>Make your application production-ready and improve testing quality</li></ul><br/><i>100 Go Mistakes and How to Avoid Them</i> puts a spotlight on common errors in Go code you might not even know you’re making. You’ll explore key areas of the language such as concurrency, testing, data structures, and more—and learn how to avoid and fix mistakes in your own projects. As you go, you’ll navigate the tricky bits of handling JSON data and HTTP services, discover best practices for Go code organization, and learn how to use slices efficiently.<br/><br/><b>About the Technology</b><br/>Understanding mistakes is the best way to improve the quality of your code. This unique book examines 100 bugs and inefficiencies common to Go applications, along with tips and techniques to avoid making them in your own projects.<br/><br/><b>About the Book</b><br/><i>100 Go Mistakes and How to Avoid Them</i> shows you how to replace common programming problems in Go with idiomatic, expressive code. In it, you’ll explore dozens of interesting examples and case studies as you learn to spot mistakes that might appear in your own applications. Expert author Teiva Harsanyi organizes the error avoidance techniques into convenient categories, ranging from types and strings to concurrency and testing.<br/><br/><b>What's Inside</b><br/><ul><li>Identify and squash code-level bugs</li><li>Avoid problems with application structure and design</li><li>Perfect your data and control structures</li><li>Optimize your code by eliminating inefficiencies</li></ul><br/><br/><b>About the Reader</b><br/>For developers proficient with Go programming and syntax.<br/><br/><b>About the Author</b><br/><b>Teiva Harsanyi</b> is a senior software engineer at Docker with experience in various domains, including safety-critical industries like air traffic management.<br/><br/><b>Quotes</b><br/><i>Required reading for Go developers before they touch code in production. It’s the Go equivalent of Effective Java.</i><br/>- Neeraj Shah, Nutanix<br/><br/><i>Clear and effective examples. Armed with the understanding of how and why mistakes occur, you’re equipped to avoid costly errors.</i><br/>- Giuseppe Maxia, Vmware<br/><br/><i>Teiva Harsanyi catalogs real problems and easy-to-miss ‘gotchas,’ and delves into the nuanced world of why they happen. Not having this book will be your 101st mistake.</i><br/>- Anupam Sengupta, Red Hat<br/><br/><i>Learn good habits by identifying bad ones. The writing is engaging, the examples relevant, and the insights useful.</i><br/>- Thad Meyer, LI-COR Biosciences<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293092/",
            "title": "Get Programming with Go",
            "description": "<span><p><i>Get Programming with Go</i> introduces you to the powerful Go language without confusing jargon or high-level theory. By working through 32 quick-fire lessons, you'll quickly pick up the basics of the innovative Go programming language! </p><br/><br/><b>About the Technology</b><br/><p>Go is a small programming language designed by Google to tackle big problems. Large projects mean large teams with people of varying levels of experience. Go offers a small, yet capable, language that can be understood and used by anyone, no matter their experience.</p><br/><br/><b>About the Book</b><br/><p>Hobbyists, newcomers, and professionals alike can benefit from a fast, modern language; all you need is the right resource! <i>Get Programming with Go</i> provides a hands-on introduction to Go language fundamentals, serving as a solid foundation for your future programming projects. You’ll master Go syntax, work with types and functions, and explore bigger ideas like state and concurrency, with plenty of exercises to lock in what you learn.</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Language concepts like slices, interfaces, pointers, and concurrency</li><li>Seven capstone projects featuring spacefaring gophers, Mars rovers, ciphers, and simulations</li><li>All examples run in the Go Playground — no installation required!</li></ul><br/><br/><b>About the Reader</b><br/><p>This book is for anyone familiar with computer programming, as well as anyone with the desire to learn.</p><br/><br/><b>About the Authors</b><br/><p><b>Nathan Youngman</b> organizes the Edmonton Go meetup and is a mentor with Canada Learning Code. <b>Roger Peppé</b> contributes to Go and runs the Newcastle upon Tyne Go meetup.</p><br/><br/><b>Quotes</b><br/><i>Perfectly organized for learning Go quickly; especially useful for inexperienced programmers.</i><br/>- MARIO CARRION, MEREDITH CORPORATION<br/><br/><i>Learn by doing! Plenty of examples will help you learn the core of the language and expose you to common Go idioms.</i><br/>- ULISES FLYNN, NAV<br/><br/><i>A great book about Go. Written for beginners but useful for seasoned developers too.</i><br/>- MIKAËL DAUTREY, ISITIX<br/><br/><i>The first rung on successfully climbing the Go ladder.</i><br/>- JEFF SMITH, AGILIFY<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292569/",
            "title": "Go Web Programming",
            "description": "<span><p><i>Go Web Programming</i> teaches you how to build scalable, high-performance web applications in Go using modern design principles.</p><br/><br/><b>About the Technology</b><br/><p>The Go language handles the demands of scalable, high-performance web applications by providing clean and fast compiled code, garbage collection, a simple concurrency model, and a fantastic standard library. It's perfect for writing microservices or building scalable, maintainable systems.</p><br/><br/><b>About the Book</b><br/><p><i>Go Web Programming</i> teaches you how to build web applications in Go using modern design principles. You'll learn how to implement the dependency injection design pattern for writing test doubles, use concurrency in web applications, and create and consume JSON and XML in web services. Along the way, you'll discover how to minimize your dependence on external frameworks, and you'll pick up valuable productivity techniques for testing and deploying your applications.</p><br/><br/><b>What's Inside</b><br/><ul><li>Basics</li><li>Testing and benchmarking</li><li>Using concurrency</li><li>Deploying to standalone servers, PaaS, and Docker</li><li>Dozens of tips, tricks, and techniques</li></ul><br/><br/><b>About the Reader</b><br/><p>This book assumes you're familiar with Go language basics and the general concepts of web development.</p><br/><br/><b>About the Author</b><br/><p><b>Sau Sheong Chang</b> is Managing Director of Digital Technology at Singapore Power and an active contributor to the Ruby and Go communities.</p><br/><br/><b>Quotes</b><br/><i>As the importance of the Go language grows, the need for a great tutorial grows with it. This book fills this need.</i><br/>- Shaun Lippy, Oracle Corporation<br/><br/><i>An excellent book, whether you are an experienced gopher, or you know web development but are new to Go.</i><br/>- Benoit Benedetti, University of Nice<br/><br/><i>Everything you need to get started writing and deploying web apps in Go.</i><br/>- Brian Cooksey, Zapier<br/><br/><i>Definitive how-to guide for web development in Go.</i><br/>- Gualtiero Testa, Factor-y S.r.l.<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617291784/",
            "title": "Go in Action",
            "description": "<span><p><i>Go in Action</i> introduces the Go language, guiding you from inquisitive developer to Go guru. The book begins by introducing the unique features and concepts of Go. Then, you'll get hands-on experience writing real-world applications including websites and network servers, as well as techniques to manipulate and convert data at speeds that will make your friends jealous.</p><br/><br/><b>About the Technology</b><br/><p>Application development can be tricky enough even when you aren't dealing with complex systems programming problems like web-scale concurrency and real-time performance. While it's possible to solve these common issues with additional tools and frameworks, Go handles them right out of the box, making for a more natural and productive coding experience. Developed at Google, Go powers nimble startups as well as big enterprises'companies that rely on high-performing services in their infrastructure.</p><br/><br/><b>About the Book</b><br/><i>Go in Action</i> is for any intermediate-level developer who has experience with other programming languages and wants a jump-start in learning Go or a more thorough understanding of the language and its internals. This book provides an intensive, comprehensive, and idiomatic view of Go. It focuses on the specification and implementation of the language, including topics like language syntax, Go's type system, concurrency, channels, and testing.<br/><br/><b>What's Inside</b><br/><ul><li>Language specification and implementation</li><li>Go's type system</li><li>Internals of Go's data structures</li><li>Testing and benchmarking</li></ul><br/><br/><b>About the Reader</b><br/><p>This book assumes you're a working developer proficient with another language like Java, Ruby, Python, C#, or C++.</p><br/><br/><b>About the Authors</b><br/><p><b>William Kennedy</b> is a seasoned software developer and author of the blog <a href=\"http://www.goinggo.net/\">GoingGo.Net</a>. <b>Brian Ketelsen</b> and <b>Erik St. Martin</b> are the organizers of GopherCon and coauthors of the Go-based Skynet framework.</p><br/><br/><b>Quotes</b><br/><i>A concise and comprehensive guide to exploring, learning, and using Go.</i><br/>- From the Foreword by Steve Francia, Creator of Hugo<br/><br/><i>This authoritative book is a one-stop shop for anyone just starting out with Go.</i><br/>- Sam Zaydel, RackTop Systems<br/><br/><i>Brilliantly written; a comprehensive introduction to Go. Highly recommended.</i><br/>- Adam McKay, SUEZ<br/><br/><i>This book makes the uncommon parts of  Go understandable and digestible.</i><br/>- Alex Vidal, HipChat at Atlassian<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633430075/",
            "title": "Go in Practice",
            "description": "<span><p><i>Go in Practice</i> guides you through 70 real-world techniques in key areas like package management, microservice communication, and more. Following a cookbook-style Problem/Solution/Discussion format, this practical handbook builds on the foundational concepts of the Go language and introduces specific strategies you can use in your day-to-day applications.</p><br/><br/><b>About the Technology</b><br/><p>Go may be the perfect systems language. Built with simplicity, concurrency, and modern applications in mind, Go provides the core tool set for rapidly building web, cloud, and systems applications. If you know a language like Java or C#, it's easy to get started with Go; the trick is finding the practical dirt-under-the-fingernails techniques that you need to build production-ready code.</p><br/><br/><b>About the Book</b><br/><p><i>Go in Practice</i> guides you through dozens of real-world techniques in key areas. Following a cookbook-style Problem/Solution/Discussion format, this practical handbook builds on the foundational concepts of the Go language and introduces specific strategies you can use in your day-to-day applications. You'll learn techniques for building web services, using Go in the cloud, testing and debugging, routing, network applications, and much more.  After finishing this book, you will be ready to build sophisticated cloud-native Go applications.</p><br/><br/><b>What's Inside</b><br/><ul><li> Dozens of specific, practical Golang techniques</li><li>Using Go for devops and cloudops</li><li> Writing RESTful web services and microservices</li><li>Practical web dev techniques</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for experienced developers who have already started exploring Go and want to use it effectively in a production setting.</p><br/><br/><b>About the Authors</b><br/><p><b>Matt Farina</b> is a Principal Engineer in the Advanced Technology Group at Hewlett Packard Enterprise. <b>Matt Butcher</b> is a software architect at Deis. They are both authors, speakers, and regular open source contributors.</p><br/><br/><b>Quotes</b><br/><i>Vital knowledge that will help take your application development to the next level.</i><br/>- From the Foreword by Brian Ketelsen, Coauthor of \"Go in Action\"<br/><br/><i>An invaluable resource you can start using on day one to build high-performance, real-world web applications.</i><br/>- Gary A. Stafford, ThoughtWorks<br/><br/><i>A great combination of simple examples with thorough explanations of practical concepts in Go.</i><br/>- Brandon Titus, Mercury<br/><br/></span>",
            "topic": "Go"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781633439290/",
            "title": "React Quickly, Second Edition",
            "description": "<span><b>Learn the skills you need to build React applications quickly! This fully revised second edition introduces JSX, functional components, React hooks, event and form handling, and more.</b><br/><br/>In <i>React Quickly, Second Edition</i> you will learn how to:<br/><br/><ul><li>Master React fundamentals</li><li>Implement best practices and the components of good architecture</li><li>Build intuitive user interfaces</li><li>Create dynamic components with JSX</li><li>Use lightweight functional components in React</li><li>Make your app interactive with stateful components</li><li>Utilize React hooks</li><li>Handle events like button clicks and pass data between components</li></ul><br/>Build your skills with React fast! There’s no slow theory and tedious history in <i>React Quickly</i>—you’ll dive into React code right from the very first chapter. As you go, you’ll explore over 80 useful and practical examples that put React into action. This new second edition has been completely rewritten to cover the latest developments in the React framework. Perfect, whether you’re a React beginner or an experienced pro looking to keep their skills up to date.<br/><br/><b>About the Technology</b><br/>React makes it a breeze to build beautiful, reliable web frontends. This amazing JavaScript library has a modular architecture, so you can create, combine, and test components seamlessly. React is perfect for small prototypes, enterprise scale sites, and everything in between.<br/><br/><b>About the Book</b><br/><i>React Quickly, Second Edition</i> offers a unique approach to learning the React framework. More than 80 concise examples guide you from your first steps through advanced applications. You’ll appreciate the up-to-date coverage of functional components, React hooks, and web accessibility, along with interesting projects to practice your new skill.<br/><br/><b>What's Inside</b><br/><ul><li>Master React fundamentals</li><li>Best practices of component-based design</li><li>Create dynamic components with JSX</li><li>Make your app interactive with stateful components</li></ul><br/><br/><b>About the Reader</b><br/>For developers comfortable building web applications with JavaScript.<br/><br/><b>About the Authors</b><br/><b>Morten Barklund</b> is an expert in React, web testing, and accessibility and is the founder of Coding Heaven. <b>Azat Mardan</b> is a seasoned software engineer, startup mentor, and best-selling author.<br/><br/><b>Quotes</b><br/><i>Simple, clear, and comprehensive with easy-to-follow examples and challenging projects. The perfect balance between theory and practice.</i><br/>- Samer Buna, author of books and courses on React and Node<br/><br/><i>I learned new things even after eight years of React experience.</i><br/>- Swizec Teller, React expert, swizec.com<br/><br/><i>More than a book! Includes a brilliant website with code in a run-time environment. A very accessible learning experience!</i><br/>- Brendan O’Hara, Untapped AI<br/><br/><i>An invaluable resource for beginners and seasoned developers alike.</i><br/>- Ahmad Nassri, Startup Advisor and Investor<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617297632/",
            "title": "React Hooks in Action",
            "description": "<span>    Build stylish, slick, and speedy-to-load user interfaces in React without writing custom classes. React Hooks are a new category of functions that help you to manage state, lifecycle, and side effects within functional components. <i>React Hooks in Action</i> teaches you to use pre-built hooks like useState, useReducer and useEffect to build your own hooks. Your code will be more reusable, require less boilerplate, and you’ll instantly be a more effective React developer.<br/><br/><b>About the Technology</b><br/>Get started with React Hooks and you’ll soon have code that’s better organized and easier to maintain. React Hooks are targeted JavaScript functions that let you reuse and share functionality across components. Use them to split components into smaller functions, manage state and side effects, and access React features without classes—all without having to rearrange your component hierarchy.<br/><br/><b>About the Book</b><br/><i>React Hooks in Action</i> teaches you to write fast and reusable React components using Hooks. You’ll start by learning to create component code with Hooks. Next, you’ll implement a resource booking application that demonstrates managing local state, application state, and side effects like fetching data. Code samples and illustrations make learning Hooks easy.<br/><br/><b>What's Inside</b><br/><ul><li>Build function components that access React features</li><li>Manage local, shared, and application state</li><li>Explore built-in, custom, and third-party hooks</li><li>Load, update, and cache data with React Query</li><li>Improve page and data loading with code-splitting and React Suspense</li></ul><br/><br/><b>About the Reader</b><br/>For beginning to intermediate React developers.<br/><br/><b>About the Author</b><br/><b>John Larsen</b> has been a teacher and web developer for over 20 years, creating apps for education and helping students learn to code. He is the author of <a href=\"https://www.manning.com/books/get-programming-with-javascript\"><i>Get Programming with JavaScript</i></a>.<br/><br/><b>Quotes</b><br/><i>Discover React Hooks, and the future of developing apps with React. A great book.</i><br/>- Arnaud Castelltort, University of Montpellier<br/><br/><i>This book covers everything that you need to know. A fantastic addition to your React arsenal.</i><br/>- Clive Harber, Distorted Thinking Ltd.<br/><br/><i>Level up your React knowledge and take advantage of the newer features and best practices.</i><br/>- Ryan Burrows, Remitly<br/><br/><i>An excellent introduction. Filled with knowledge nuggets and real-world use cases.</i><br/>- Edin Kapić, isolution<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294051/",
            "title": "React Native in Action",
            "description": "<span><p><i>React Native in Action</i> gives iOS, Android, and web developers the knowledge and confidence they need to begin building high-quality iOS and Android apps using the React Native framework.</p><br/><br/><b>About the Technology</b><br/><p>React Native gives mobile and web developers the power of \"and.\" Write your app once and easily deploy it to iOS and Android and the web. React Native apps compile into platform-specific code, reducing development time, effort, and cost! And because you're using JavaScript and the React framework, you benefit  from a huge ecosystem of tools, expertise, and support.</p><br/><br/><b>About the Book</b><br/><p><i>React Native in Action</i> teaches you to build high-quality cross-platform mobile and web apps. In this hands-on guide, you'll jump right into building a complete app with the help of clear, easy-to-follow instructions. As you build your skills, you'll drill down to more-advanced topics like styling, APIs, animations, data architecture, and more! You'll also learn how to maximize code reuse without sacrificing native platform look-and-feel.</p><br/><br/><b>What's Inside</b><br/><ul><li>Building cross-platform mobile and web apps</li><li>Routing, Redux, and animations</li><li>Cross-network data requests</li><li>Storing and retrieving data locally</li><li>Managing data and state</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for beginner-to-intermediate web, Android, and iOS developers.</p><br/><br/><b>About the Author</b><br/><p><b>Nader Dabit</b> is a developer advocate at AWS Mobile, where he works on tools and services to allow developers to build full-stack web and mobile applications using their existing skillset. He is also the founder of React Native Training and the host of the \"React Native Radio\" podcast.</p><br/><br/><b>Quotes</b><br/><i>Learn how to utilize your existing JavaScript skills to create rich cross-platform mobile apps.</i><br/>- Ian Lovell, Parmenion Capital Partners<br/><br/><i>Dabit not only teaches, he guides you into details and introspection that only an expert React Native veteran can know.</i><br/>- Joseph Tingsanchali, Netspend<br/><br/><i>A quick and practical way to become productive with React Native.</i><br/>- Francesco Strazzullo, extrategy<br/><br/><i>Your definitive companion to learning React Native.</i><br/>- Ubaldo Pescatore, Datalogic<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293344/",
            "title": "React Quickly",
            "description": "<span><p><i>React Quickly</i> is for anyone who wants to learn React.js fast. This hands-on book teaches you the concepts you need with lots of examples, tutorials, and a large main project that gets built throughout the book. </p><br/><br/><b>About the Technology</b><br/><p>Successful user interfaces need to be visually interesting, fast, and flowing. The React.js JavaScript library supercharges view-heavy web applications by improving data flow between UI components. React sites update visual elements efficiently and smoothly, minimizing page reloads. React is developer friendly, with a strong ecosystem to support the dev process along the full application stack. And because it's all JavaScript, React is instantly familiar. </p><br/><br/><b>About the Book</b><br/><p><i>React Quickly</i> is the tutorial for web developers who want to get started fast with React.js. Following carefully chosen and clearly explained examples, you'll learn React development using your existing JavaScript and web dev skills. You'll explore a host of different projects as you learn about web components, forms, and data. </p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Master React fundamentals</li><li>Build full web apps with data and routing</li><li>Test components</li><li>Optimize React apps</li></ul><br/><br/><b>About the Reader</b><br/><p> This book is for developers comfortable building web applications with JavaScript. </p><br/><br/><b>About the Author</b><br/><p><b>Azat Mardan</b> is a Tech Fellow at Capital One with extensive experience using and teaching JavaScript and Node, and author of several books on JavaScript, Node, React, and Express.</p><br/><br/><b>Quotes</b><br/><i>Simply the best way to learn React.js.</i><br/>- From the Foreword by John Sonmez, Author of Soft Skills<br/><br/><i>A one-stop shop for anyone who wants a guided introduction, not only to React, but to the ecosystem of tools, concepts, and libraries surrounding it.</i><br/>- Peter Cooper, Editor of JavaScript Weekly<br/><br/><i>Perfect for new React developers and seasoned veterans alike.</i><br/>- Matthew Heck, TechChange<br/><br/><i>An absolutely engaging read, where theory meets practice!</i><br/>- Dane Balia, Hetzner<br/><br/><i>Excellent introduction for getting up to speed on React...quickly!</i><br/>- Art Bergquist, Cognetic Technologies<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293856/",
            "title": "React in Action",
            "description": "<span><p><i>React in Action</i> introduces front-end developers to the React framework and related tools. This clearly written, example-rich book begins by introducing you to React, diving into some of the fundamental ideas in React, and working with components. In the second section, you'll explore the different ways that data works in React as well as learning more about components. You'll also find several useful appendixes covering related topics like React tooling and the React ecosystem.</p><br/><br/><b>About the Technology</b><br/><p>Facebook created React to help deliver amazing user experiences on a website with thousands of components and an incomprehensible amount of traffic. The same powerful tools are available to you too! The key is a clever design for managing state, data flow, and rendering, so your application is easy to think about and runs smoothly. Add an incredibly rich ecosystem of components and libraries, and you've got a recipe for building web apps that will delight both developers and users.</p><br/><br/><b>About the Book</b><br/><p><i>React in Action</i> teaches you to think like a pro about user interfaces and building them with React. This practical book gets you up and running quickly with hands-on examples in every chapter. You'll master core topics like rendering, lifecycle methods, JSX, data flow, forms, routing, integrating with third-party libraries, and testing. And the included application design ideas will help make your apps pop. As you learn to integrate React into full-stack applications, you'll explore state management with Redux and server-side rendering, and even dabble in React Native for mobile UIs. </p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>React from the ground up</li><li>Implementing a routing system with components</li><li>Server-side rendering in Node.js</li><li>Working with third-party libraries</li><li>Testing React components</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for developers familiar with HTML, CSS, and JavaScript.</p><br/><br/><b>About the Author</b><br/><p><b>Mark Thomas</b> is an experienced software engineer who works daily with React, JavaScript, and Node.js. He loves clean code, beautiful systems, and good coffee.</p><br/><br/><b>Quotes</b><br/><i>Read this. Work with React. Never look back.</i><br/>- Michal Paszkiewicz, Transport for London<br/><br/><i>One stop—for concepts as well as for real-world examples and integrations.</i><br/>- Phaneendra Bommareddy, Openlogix<br/><br/><i>A must-have for anyone wanting to create applications using React and Redux!</i><br/>- Andrew Courter, Pivotal<br/><br/><i>Easy to follow, clearly demonstrates all necessary steps, includes plenty of code examples, and never leaves you in the dark.</i><br/>- Olivier Ducatteeuw, University of Leuven<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294396/",
            "title": "Isomorphic Web Applications",
            "description": "<span><p><i>Isomorphic Web Applications</i> teaches you to build production-quality web apps using isomorphic architecture. Designed for working developers, this book offers examples in relevant frameworks like React, Redux, Angular, Ember, and webpack.</p><br/><br/><b>About the Technology</b><br/><p>Build secure web apps that perform beautifully with high, low, or no bandwidth. Isomorphic web apps employ a pattern that exploits the full stack, storing data locally and minimizing server hits. They render flawlessly, maximize SEO, and offer opportunities to share code and libraries between client and server.</p><br/><br/><b>About the Book</b><br/><p><i>Isomorphic Web Applications</i> teaches you to build production-quality web apps using isomorphic architecture. You'll learn to create and render views for both server and browser, optimize local storage, streamline server interactions, and handle data serialization. Designed for working developers, this book offers examples in relevant frameworks like React, Redux, Angular, Ember, and webpack. You'll also explore unique debugging and testing techniques and master specific SEO skills. </p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Controlling browser and server user sessions </li><li>Combining server-rendered and SPA architectures</li><li>Building best-practice React applications</li><li>Debugging and testing</li></ul><br/><br/><b>About the Reader</b><br/><p>To benefit from this book, readers need to know JavaScript, HTML5, and a framework of their choice, including React and Angular.</p><br/><br/><b>About the Author</b><br/><p><b>Elyse Kolker Gordon</b> runs the growth engineering team at Strava. Previously, she was director of web engineering at Vevo, where she regularly solved challenges with isomorphic apps.</p><br/><br/><b>Quotes</b><br/><i>A practical guide to performant and modern JavaScript applications.</i><br/>- Bojan Djurkovic, Cvent<br/><br/><i>Clear and powerful. If you need just one resource, this is it.</i><br/>- Peter Perlepes, Growth<br/><br/><i>Thorough and methodical coverage for novice users, with handy insights and many ‘aha’ moments for advanced users. Highly recommended.</i><br/>- Devang Paliwal, Synapse<br/><br/><i>An essential guide for anyone developing modern JavaScript applications.</i><br/>- Mike Jensen, UrbanStems<br/><br/></span>",
            "topic": "React"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294754/",
            "title": "Getting MEAN with Mongo, Express, Angular, and Node, Second Edition",
            "description": "<span><p><i>Getting MEAN, Second Edition</i> teaches you how to develop full-stack web applications using the MEAN stack. This edition was completely revised and updated to cover MongoDB 4, Express 4, Angular 7, Node 11, and the latest mainstream release of JavaScript ES2015.</p><br/><br/><b>About the Technology</b><br/><p>Juggling languages mid-application can radically slow down a full-stack web project. The MEAN stack—MongoDB, Express, Angular, and Node—uses JavaScript end to end, maximizing developer productivity and minimizing context switching. And you’ll love the results! MEAN apps are fast, powerful, and beautiful.</p><br/><br/><b>About the Book</b><br/><p><i>Getting MEAN, Second Edition</i> teaches you how to develop full-stack web applications using the MEAN stack. Practical from the very beginning, the book helps you create a static site in Express and Node. Expanding on that solid foundation, you’ll integrate a MongoDB database, build an API, and add an authentication system. Along the way, you’ll get countless pro tips for building dynamic and responsive data-driven web applications! </p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>MongoDB 4, Express 4, Angular 7, and Node.js 11</li><li>MEAN stack architecture</li><li>Mobile-ready web apps</li><li>Best practices for efficiency and reusability</li></ul><br/><br/><b>About the Reader</b><br/><p>Readers should be comfortable with standard web application designs and ES2015-style JavaScript.</p><br/><br/><b>About the Author</b><br/><p><b>Simon Holmes</b> and <b>Clive Harber</b> are full-stack developers with decades of experience in JavaScript and other leading-edge web technologies.</p><br/><br/><b>Quotes</b><br/><i>Wonderfully detailed walk-through from front end to back end, from UI to data—and all the connectivity in between.</i><br/>- Joseph Tingsanchali, Netspend<br/><br/><i>Provides an accelerated learning process through building an application that mimics a realistic/useful application.</i><br/>- Foster Haines, Rhodes Group<br/><br/><i>Great project-based approach to the material, covering every aspect of the stack from responsive layout to live database deployment.</i><br/>- Tony Mullen, Northeastern University<br/><br/><i>Holmes and Harber make it easy!</i><br/>- James McGinn, Bull Valley Software<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294747/",
            "title": "Get Programming with Node.js",
            "description": "<span><p><i>Get Programming with Node.js</i> Get Programming with Node.js teaches you to write server-side code in JavaScript using Node.js. In 37 fast-paced, fun, and practical lessons, you'll discover how to extend your existing JavaScript skills to write back-end code for your web applications.</p><br/><br/><b>About the Technology</b><br/><p>Node.js delivers the speed and reliability you need for ecommerce, social media, and gaming applications. It comes with thousands of prebuilt packages to help you get started immediately. If you want to use JavaScript on the server, Node.js is your choice.</p><br/><br/><b>About the Book</b><br/><p><i>Get Programming with Node.js</i> teaches you to build web servers using JavaScript and Node. In this engaging tutorial, you’ll work through eight complete projects, from writing the code for your first web server to adding live chat to a web app. Your hands will stay on the keyboard as you explore the most important aspects of the Node development process, including security, database management, authenticating user accounts, and deploying to production. You’ll especially appreciate the easy-to-follow discussions, illuminating diagrams, and carefully explained code!</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>New features from ES2015 and later</li><li>Writing asynchronous code</li><li>Creating data models</li><li>Debugging JavaScript modules</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for front-end web developers with intermediate JavaScript skills.</p><br/><br/><b>About the Author</b><br/><p><b>Jonathan Wexler</b> is skilled in production-grade, full-stack web development. He’s a senior developer with Bloomberg.</p><br/><br/><b>Quotes</b><br/><i>Lays out a refreshingly down-to-earth, pragmatic, and clear path that shows you how to navigate your way through Node.js.</i><br/>- From the foreword by Kyle Simpson, Getify<br/><br/><i>Will take you from average JavaScript programmer to Node Ninja in less than a week!</i><br/>- Joseph White, Joecasa Consulting<br/><br/><i>Great step-by-step instructions on how to build a Node.js app using the latest technologies.</i><br/>- Jeremy Lange, Sertifi<br/><br/><i>The go-to book to learn the intricacies of Node and become productive fast.</i><br/>- Vipul Gupta, Microsoft<br/><br/><i>An approachable, modern, and enjoyable introduction to Node.js.</i><br/>- Bryce Darling, Advanced Data and Network Solutions<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292576/",
            "title": "Node.js in Action, Second Edition",
            "description": "<span><p><i>Node.js in Action, Second Edition</i> is a thoroughly revised book based on the best-selling first edition. It starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. </p><br/><br/><b>About the Technology</b><br/><p>You already know JavaScript. The trick to mastering Node.js is learning how to build applications that fully exploit its powerful asynchronous event handling and non-blocking I/O features. The Node server radically simplifies event-driven real-time apps like chat, games, and live data analytics, and with its incredibly rich ecosystem of modules, tools, and libraries, it's hard to beat!</p><br/><br/><b>About the Book</b><br/><p>Based on the bestselling first edition, <i>Node.js in Action, Second Edition</i> is a completely new book. Packed with practical examples, it teaches you how to create high-performance web servers using JavaScript and Node. You'll master key design concepts such as asynchronous programming, state management, and event-driven programming. And you'll learn to put together MVC servers using Express and Connect, design web APIs, and set up the perfect production environment to build, lint, and test.</p><br/><br/><b>What's Inside</b><br/><ul><li>Mastering non-blocking I/O</li><li>The Node event loop</li><li>Testing and deploying</li><li>Web application templating</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for web developers with intermediate JavaScript skills. </p><br/><br/><b>About the Authors</b><br/><p>The Second Edition author team includes Node masters <b>Alex Young</b>, <b>Bradley Meck</b>, <b>Mike Cantelon</b>, and <b>Tim Oxley</b>, along with original authors <b>Marc Harter</b>, <b>T.J. Holowaychuk</b>, and <b>Nathan Rajlich</b>.</p><br/><br/><b>Quotes</b><br/><i>The definitive guide to one of the most important tools of the modern web.</i><br/>- William E. Wheeler, TEKsystems<br/><br/><i>Everything you need to know about Node.js...and then some.</i><br/>- Sander Rossel, COAS Software Systems<br/><br/><i>Node is a vast subject; this book is both a lighthouse and a manual.</i><br/>- Philippe Charriere, Clever Cloud<br/><br/><i>A gentle but powerful introduction to the Node.js ecosystem.</i><br/>- Jeff Smith, Ascension<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617294723/",
            "title": "Serverless Applications with Node.js",
            "description": "<span><p><i>Serverless Applications with Node.js</i> walks you through building serverless apps on AWS using JavaScript. Inside, you'll discover what Claudia.js brings to the table as you build and deploy a scalable event-based serverless application, based around a pizzeria that’s fully integrated with AWS services, including Lambda and API Gateway. Each chapter is filled with exercises, examples, tips, and more to make sure you’re ready to bring what you’ve learned into your own work.</p><br/><br/><b>About the Technology</b><br/><p>The benefits of cloud-hosted serverless web apps are undeniable: lower complexity, quicker time to market, and easier scalability than traditional, server-dependent designs. And thanks to JavaScript support in AWS Lambda and powerful new serverless API tools like the Claudia.js library, you can build and deploy serverless apps end to end without learning a new language.</p><br/><br/><b>About the Book</b><br/><p><i>Serverless Applications with Node.js</i> teaches you to design and build serverless web apps on AWS using JavaScript, Node, and Claudia.js. You’ll master the basics of writing AWS Lambda functions, along with core serverless patterns like API Gateway. Along the way, you’ll practice your new skills by building a working chatbot and a voice assistant with Amazon Alexa. You’ll also discover techniques for migrating existing apps to a serverless platform.</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Authentication and database storage</li><li>Asynchronous functions</li><li>Interesting real-world examples</li><li>Developing serverless microservices</li></ul><br/><br/><b>About the Reader</b><br/><p>For web developers comfortable with JavaScript and Node.js.</p><br/><br/><b>About the Authors</b><br/><p><b>Slobodan Stojanović</b> and <b>Aleksandar Simović</b> are AWS Serverless Heroes and core contributors to the Claudia.js project. They are also coauthors of Desolé, an open source serverless errortracking tool, and the lead developers of Claudia Bot Builder.</p><br/><br/><b>Quotes</b><br/><i>Teaches you how to get simple stuff done in AWS Lambda quickly, without trying to change the way you structure or run projects.</i><br/>- From the Foreword by Gojko Adzic, Neuri Consulting<br/><br/><i>A top-notch and hands-on resource written by world-renowned experts who will get you up to speed in no time with AWS Lambda using Claudia.js.</i><br/>- Valentin Crettaz, Consulthys<br/><br/><i>One of the most comprehensive books published on the topic; contains a wealth of resources that you will not find online.</i><br/>- Damian Esteban, BetterPT<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617293436/",
            "title": "Nim in Action",
            "description": "<span><p>Nim is a multi-paradigm language that offers powerful customization options with the ability to compile to everything from C to JavaScript. In <i>Nim in Action </i> you'll learn how Nim compares to other languages in style and performance, master its structure and syntax, and discover unique features.</p><br/><br/><b>About the Technology</b><br/><p>Nim is a multi-paradigm programming language that offers powerful customization options with the ability to compile to everything from C to JavaScript. It can be used in any project and illustrates that you don't have to sacrifice performance for expressiveness!</p><br/><br/><b>About the Book</b><br/><p><i>Nim in Action</i> is your guide to application development in Nim. You'll learn how Nim compares to other languages in style and performance, master its structure and syntax, and discover unique features. By carefully walking through a Twitter clone and other real-world examples, you'll see just how Nim can be used every day while also learning how to tackle concurrency, package finished applications, and interface with other languages. With the best practices and rich examples in this book, you'll be able to start using Nim today.</p><br/><br/><b>What's Inside</b><br/><ul><li>Language features and implementation</li><li>Nimble package manager</li><li>Asynchronous I/O</li><li>Interfacing with C and JavaScript</li><li>Metaprogramming</li></ul><br/><br/><b>About the Reader</b><br/><p>For developers comfortable with mainstream languages like Java, Python, C++ or C#.</p><br/><br/><b>About the Author</b><br/><p><b>Dominik Picheta</b> is one of the principal developers of Nim and author of the Nimble package manager.</p><br/><br/><b>Quotes</b><br/><i>A great resource for an incredibly powerful language.</i><br/>- Jonathan Rioux, TD Insurance<br/><br/><i>Gives readers a solid foundation in Nim, a robust and flexible language suitable for a variety of projects.</i><br/>- Robert Walsh, Excalibur Solutions<br/><br/><i>A great job breaking down the language. This book will no doubt become the de facto learning guide in the Nim space.</i><br/>- Peter J. Hampton, Ulster University<br/><br/><i>A goldmine for Nim programmers; great insights for any general programmer.</i><br/>- Cosimo Attanasi, ER Sistemi<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617290930/",
            "title": "Node.js in Practice",
            "description": "<span><p><i>Node.js in Practice</i> is a collection of fully tested examples that offer solutions to the common and not-so-common issues you face when you roll out Node. You'll dig into important topics like the ins and outs of event-based programming, how and why to use closures, how to structure applications to take advantage of end-to-end JavaScript apps, and more.</p><br/><br/><b>About the Technology</b><br/><br/><br/><b>About the Book</b><br/><p>You've decided to use Node.js for your next project and you need the skills to implement Node in production. It would be great to have Node experts Alex Young and Marc Harter at your side to help you tackle those day-to-day challenges. With this book, you can!</p><p><i>Node.js in Practice</i> is a collection of 115 thoroughly tested examples and instantly useful techniques guaranteed to make any Node application go more smoothly. Following a common-sense Problem/Solution format, these experience-fueled techniques cover important topics like event-based programming, streams, integrating external applications, and deployment. The abundantly annotated code makes the examples easy to follow, and techniques are organized into logical clusters, so it's a snap to find what you're looking for.</p><br/><br/><b>What's Inside</b><br/><ul><li>Common usage examples, from basic to advanced</li><li>Designing and writing modules</li><li>Testing and debugging Node apps</li><li>Integrating Node into existing systems</li></ul><br/><br/><b>About the Reader</b><br/><p>Written for readers who have a practical knowledge of JavaScript and the basics of Node.js.</p><br/><br/><b>About the Authors</b><br/><p><b>Alex Young</b> is a seasoned JavaScript developer who blogs regularly at DailyJS. <b>Marc Harter</b> works daily on large-scale projects including high-availability real-time applications, streaming interfaces, and other data-intensive systems.</p><br/><br/><b>Quotes</b><br/><i>An in-depth tour of Node.js</i><br/>- From the Foreword by Ben Noordhuis, Cofounder of StrongLoop, Inc.<br/><br/><i>The missing manual for Node.js, packed with real-world examples!</i><br/>- Kevin Baister, 1KB Software Solutions Ltd.<br/><br/><i>Essential recipes for the server-side JavaScript developer.</i><br/>- Gregor Zurowski, Sotheby’s<br/><br/><i>Useful techniques and resources that help with problem solving, debugging, and troubleshooting.</i><br/>- Michael Piscatello, MBP Enterprises, LLC<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292613/",
            "title": "Sails.js in Action",
            "description": "<span><p><i>Sails.js in Action</i> is a comprehensive guide to buildingenterprise-capable web applications using Node and Sails. Written by the creators of the Sails.js framework, this book carefully introduces each concept, technique, and tool with real-world examples and crystal clear explanations.</p><br/><br/><b>About the Technology</b><br/><p>Sails makes professional web development a breeze. This instantly familiar MVC framework automatically handles the tedious application boilerplate, so you can concentrate on developing features and creating business value. You get powerful tools for rapid API development, task automation, an ORM, and easy integration with any web, mobile, or IoT frontend. And because you're using Node.js, it's JavaScript all the way down.</p><br/><br/><b>About the Book</b><br/><p><i>Sails.js in Action</i> is a comprehensive guide on how to build enterprise-capable web applications. Written by the creators of Sails.js, this book introduces each concept and technique with real-world examples and thorough explanations. As you read, you'll learn to build the backend of a typical web application while you explore real-time programming with WebSockets, security fundamentals, and best practices for building Sails/Node.js apps.</p><br/><br/><b>What's Inside</b><br/><p></p><ul><li>Creating the backend for a web, mobile, or IoT app</li><li>Real-time programming with WebSockets</li><li>User management, authentication, and password recovery</li><li>Using Sails to autogenerate REST APIs</li><li>Custom backend development and third-party API integrations </li></ul><br/><br/><b>About the Reader</b><br/><p>Readers should be comfortable with JavaScript and frontend web development. </p><br/><br/><b>About the Authors</b><br/><p><b>Mike McNeil</b> is the creator of Sails.js. <b>Irl Nathan</b> is the producer of sailsCasts, a series focused on using Sails.</p><br/><br/><b>Quotes</b><br/><i>Look no further - you've found the ultimate source.</i><br/>- Damien White, Visoft<br/><br/><i>This book is your path through the crazy jungle of JavaScript.</i><br/>- Sam Kreter, Software Engineer, Microsoft<br/><br/><i>Get up to speed quickly on full-stack web development using Sails.js.</i><br/>- Alvin Raj, Oracle<br/><br/><i>If you need to ship fast with Node.js, this book will definitely float your boat.</i><br/>- Stephen Byrne, Dell<br/><br/><i>Comprehensive...equally relevant to both beginners and professionals.</i><br/>- Damian Esteban, betterPT<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617292033/",
            "title": "Getting MEAN with Mongo, Express, Angular, and Node",
            "description": "<span><p><i>Getting MEAN</i> teaches readers how to develop web applications end-to-end using the MEAN stack. You'll systematically discover each technology in the MEAN stack as you build up an application one layer at a time, just as you'd do in a real project.</p><br/><br/><b>About the Technology</b><br/><p>Traditional web dev stacks use a different programming language in every layer, resulting in a complex mashup of code and frameworks. Together, the MongoDB database, the Express and AngularJS frameworks, and Node.js constitute the MEAN stack - a powerful platform that uses only one language, top to bottom: JavaScript. Developers and businesses love it because it's scalable and cost-effective. End users love it because the apps created with it are fast and responsive. It's a win-win-win!</p><br/><br/><b>About the Book</b><br/><p><i>Getting MEAN</i> teaches you how to develop web applications using the MEAN stack. First, you'll create the skeleton of a static site in Express and Node, and then push it up to a live web server. Next, add a MongoDB database and build an API before using Angular to handle data manipulation and application logic in the browser. Finally you'll add an authentication system to the application, using the whole stack. When you finish, you'll have all the skills you need to build a dynamic data-driven web application.</p><br/><br/><b>What's Inside</b><br/><ul><li>Full-stack development using JavaScript</li><li>Responsive web techniques</li><li>Everything you need to get started with MEAN</li><li>Best practices for efficiency and reusability</li></ul><br/><br/><b>About the Reader</b><br/><p>Readers should have some web development experience. This book is based on MongoDB 2, Express 4, Angular 1, and Node.js 4. </p><br/><br/><b>About the Author</b><br/><p><b>Simon Holmes</b> has been a full-stack developer since the late 1990s and runs Full Stack Training Ltd. </p><br/><br/><b>Quotes</b><br/><i>Looking to go full stack? Getting MEAN will take you there.</i><br/>- Matt Merkes, MyNeighbor<br/><br/><i>Fantastic explanations and up-to-date, real-world examples.</i><br/>- Rambabu Posa, LGL Assessment<br/><br/><i>From novice to experienced developer, all who want to use the MEAN stack will get useful advice here.</i><br/>- Davide Molin, CodingShack.com<br/><br/><i>A ground-up explanation of MEAN stack layers.</i><br/>- Andrea Tarocchi, Red Hat<br/><br/></span>",
            "topic": "Node.js"
        },
        {
            "cover_url": "https://learning.oreilly.com/library/cover/9781617290572/",
            "title": "Node.js in Action",
            "description": "<span><p><i>Node.js in Action</i> is an example-driven tutorial that starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. You'll start by learning how to set up your Node development environment, including loading the community-created extensions. Next, you'll run several simple demonstration programs where you'll learn the basics of a few common types of Node applications. Then you'll dive into asynchronous programming, a model Node leverages to lessen application bottlenecks.</p><br/><br/><b>About the Technology</b><br/><p>JavaScript on the server? You bet. Node.js is a JavaScript server capable of supporting scalable, high-performance web applications. Using asynchronous I/O, the server can do more than one thing at a time, a key requirement for real-time apps like chat, games, and live statistics. And since it's JavaScript, you use the same language end to end.</p><br/><br/><b>About the Book</b><br/><p><i>Node.js in Action</i> shows you how to build production-quality applications. Clear introductions of key concepts  and example-by-example coverage take you from setup to deployment. You'll dive into asynchronous programming, data storage, and output templating, and interact with the filesystem to create non-HTTP applications like TCP/IP servers and command-line tools. Perfect for a web developer transitioning from Rails, Django, or PHP.</p><br/><br/><b>What's Inside</b><br/><ul><li>Set up Node and extensions</li><li>Grok asynchronous programming and the event loop</li><li>Examples including microblogging, IM, games, and more</li></ul><br/><br/><b>About the Reader</b><br/><p>Requires basic knowledge of JavaScript. No prior experience with Node.js needed.</p><br/><br/><b>About the Authors</b><br/><p>As skilled practitioners, expert teachers and trainers, and contributors to the core framework, authors <b>Mike Cantelon</b>, <b>Marc Harter</b>, <b>T.J. Holowaychuk</b>, and <b>Nathan Rajlich</b> represent the best of the Node.js development community.</p><br/><br/><b>Quotes</b><br/><i>The content ramps up nicely from basic to advanced.</i><br/>- From the Foreword by Isaac Z. Schlueter, Node.js Project Lead<br/><br/><i>The definitive guide to Node and the Node.js ecosystem.</i><br/>- Kevin Baister, 1KB Software Solutions<br/><br/><i>Superbly written with practical (and even funny) real-world examples.</i><br/>- Àlex Madurell, Polymedia SpA<br/><br/><i>Thoroughly enjoyable ... will get you up and running very quickly.</i><br/>- Gary Ewan Park, Honeywell<br/><br/><i>An excellent resource written by the people behind the code.</i><br/>- Brian Falk, NodeLingo, GoChime<br/><br/></span>",
            "topic": "Node.js"
        }
    ]
}

